{"title": "Automated Repair of Ambiguous Natural Language Requirements", "first_label": ["APR"], "second_label": ["Repair"], "data": "H Jia, R Morris, H Ye, F Sarro, S Mechtaev\\xc2\\xa0- arXiv preprint arXiv:2505.07270, 2025\nThe rise of large language models (LLMs) has amplified the role of natural language \n(NL) in software engineering, and its inherent ambiguity and susceptibility to \nmisinterpretation pose a fundamental challenge for software quality, because \nemploying ambiguous requirements may result in the generation of faulty programs. \nThe complexity of ambiguity detection and resolution motivates us to introduce the \nproblem of automated repair of ambiguous NL requirements. Repairing ambiguity in\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaSpecRover: Code Intent Extraction via LLMs\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.07270&hl=en&sa=X&d=10391489532693872445&ei=epgmaJXiIYOkieoP_ZHm8Qg&scisig=AAZF9b-GEPQzdUvtLkd0XmTxxHM8&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AAZF9b8j6D2HAFt59uW8wFlKdfsL&html=&pos=0&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["7 new citations to articles by Abhik Roychoudhury", "Bach Le - new related research"]}
{"title": "Harnessing LLMs Explanations to Boost Surrogate Models in Tabular Data Classification", "first_label": ["LLM"], "second_label": [], "data": "R Shi, H Gu, X Shen, X Wang\\xc2\\xa0- arXiv preprint arXiv:2505.05744, 2025\nLarge Language Models (LLMs) have shown remarkable ability in solving complex \ntasks, making them a promising tool for enhancing tabular learning. However, \nexisting LLM-based methods suffer from high resource requirements, suboptimal \ndemonstration selection, and limited interpretability, which largely hinder their \nprediction performance and application in the real world. To overcome these \nproblems, we propose a novel in-context learning framework for tabular prediction\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaAutomated Repair of Programs from Large Language Models\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.05744&hl=en&sa=X&d=1352175923917682258&ei=epgmaJXiIYOkieoP_ZHm8Qg&scisig=AAZF9b9y9FmxyfsI_VDj64C-2kPc&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AAZF9b8j6D2HAFt59uW8wFlKdfsL&html=&pos=1&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["7 new citations to articles by Abhik Roychoudhury"]}
{"title": "Large Language Model-driven Security Assistant for Internet of Things via Chain-of-Thought", "first_label": ["LLM"], "second_label": [], "data": "M Zeng, M Xie, X Zheng, C Li, C Zhang, L Zhu\\xc2\\xa0- arXiv preprint arXiv:2505.06307, 2025\nThe rapid development of Internet of Things (IoT) technology has transformed \npeople's way of life and has a profound impact on both production and daily \nactivities. However, with the rapid advancement of IoT technology, the security of IoT \ndevices has become an unavoidable issue in both research and applications. \nAlthough some efforts have been made to detect or mitigate IoT security \nvulnerabilities, they often struggle to adapt to the complexity of IoT environments\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaLarge language model guided protocol fuzzing\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.06307&hl=en&sa=X&d=16115038780100543032&ei=epgmaJXiIYOkieoP_ZHm8Qg&scisig=AAZF9b9dPDFFdMyAL3TuK0ztUCmC&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AAZF9b8j6D2HAFt59uW8wFlKdfsL&html=&pos=2&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["7 new citations to articles by Abhik Roychoudhury"]}
{"title": "An Empirical Study of Fuzz Harness Degradation", "first_label": ["Fuzzing"], "second_label": [], "data": "P G\\xc3\\xb6rz, J Schilling, T Holz, M B\\xc3\\xb6hme\\xc2\\xa0- arXiv preprint arXiv:2505.06177, 2025\nThe purpose of continuous fuzzing platforms is to enable fuzzing for software projects \nvia\\\\emph {fuzz harnesses}--but as the projects continue to evolve, are these \nharnesses updated in lockstep, or do they run out of date? If these harnesses remain \nunmaintained, will they\\\\emph {degrade} over time in terms of coverage achieved or \nnumber of bugs found? This is the subject of our study. We study Google's OSS-Fuzz \ncontinuous fuzzing platform containing harnesses for 510 open-source C/C++\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaFuzzing: Challenges and Reflections\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.06177&hl=en&sa=X&d=2485568784956736566&ei=epgmaJXiIYOkieoP_ZHm8Qg&scisig=AAZF9b9U12dlNX8ME_M7I0S0wvL7&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AAZF9b8j6D2HAFt59uW8wFlKdfsL&html=&pos=3&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["7 new citations to articles by Abhik Roychoudhury"]}
{"title": "Byam: Fixing Breaking Dependency Updates with Large Language Models", "first_label": ["LLM"], "second_label": [], "data": "F Reyes, M Mahmoud, F Bono, S Nadi, B Baudry\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nApplication Programming Interfaces (APIs) facilitate the integration of third-party \ndependencies within the code of client applications. However, changes to an API, \nsuch as deprecation, modification of parameter names or types, or complete \nreplacement with a new API, can break existing client code. These changes are \ncalled breaking dependency updates; It is often tedious for API users to identify the \ncause of these breaks and update their code accordingly. In this paper, we explore\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaAutomated Program Repair\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.07522&hl=en&sa=X&d=1407375154174056498&ei=epgmaJXiIYOkieoP_ZHm8Qg&scisig=AAZF9b9loQLoOI-BtQ0G1Vit1gGf&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AAZF9b8j6D2HAFt59uW8wFlKdfsL&html=&pos=4&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["7 new citations to articles by Abhik Roychoudhury", "David Lo - new related research", "Xin ZHOU - new related research", "Hong Jin Kang - new related research"]}
{"title": "Synthetic Code Surgery: Repairing Bugs and Vulnerabilities with LLMs and Synthetic Data", "first_label": ["Vulnerabilities", "LLM", "Code", "Bug"], "second_label": ["Repair"], "data": "D de-Fitero-Dominguez, A Garcia-Cabot\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nThis paper presents a novel methodology for enhancing Automated Program Repair \n(APR) through synthetic data generation utilizing Large Language Models (LLMs). \nCurrent APR systems are constrained by the limited availability of high-quality \ntraining data encompassing diverse bug types across multiple programming \nlanguages. The proposed approach addresses this limitation through a two-phase \nprocess: a synthetic sample generation followed by a rigorous quality assessment\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaAngelix: Scalable multiline program patch synthesis via symbolic\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.07372&hl=en&sa=X&d=11439986521091921636&ei=epgmaJXiIYOkieoP_ZHm8Qg&scisig=AAZF9b8RCsa712EGlIk9Yf-8SOBV&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AAZF9b8j6D2HAFt59uW8wFlKdfsL&html=&pos=5&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["7 new citations to articles by Abhik Roychoudhury", "Quang-Cuong Bui - new related research", "Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "Bach Le - new related research"]}
{"title": "Research on Linux Kernel Fuzz Testing Technology Based on Generative Adversarial Networks", "first_label": ["Fuzzing", "Software Testing"], "second_label": ["Search"], "data": "Z Wang, S Yuan, Y Zhang, X Chen, Z Xiao - 2025\nCurrently, Linux kernel fuzz testing techniques primarily rely on system call templates \nto generate test cases. However, this approach suffers from significant drawbacks, \nincluding high manual effort, poor adaptability to evolving vulnerabilities, and limited \ntest case effectiveness. Given the increasing demand for robust security in Linux-\nbased systems, more intelligent and automated fuzz testing methods are essential for \nimproving vulnerability detection efficiency. To address these issues, this paper\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaDirected greybox fuzzing\\xe2\\x80\\xac  \n \nThis message was sent by Google Scholar because you\\'re following new citations to articles written by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://itiis.org/digital-library/manuscript/file/102452/TIIS%2520Vol%252019,%2520No%25204-12.pdf&hl=en&sa=X&d=9556802590366379246&ei=epgmaJXiIYOkieoP_ZHm8Qg&scisig=AAZF9b-4wJjHwLHBNHi-pWJUmTeR&oi=scholaralrt&hist=ylyK0_8AAAAJ:10071049626428824134:AAZF9b8j6D2HAFt59uW8wFlKdfsL&html=&pos=6&folt=cit", "author": ["Abhik Roychoudhury"], "ref": ["7 new citations to articles by Abhik Roychoudhury"]}
{"title": "System Prompt Poisoning: Persistent Attacks on Large Language Models Beyond User Injection", "first_label": ["LLM"], "second_label": [], "data": "J Guo, H Cai\\xc2\\xa0- arXiv preprint arXiv:2505.06493, 2025\nLarge language models (LLMs) have gained widespread adoption across diverse \napplications due to their impressive generative capabilities. Their plug-and-play \nnature enables both developers and end users to interact with these models through \nsimple prompts. However, as LLMs become more integrated into various systems in \ndiverse domains, concerns around their security are growing. Existing studies mainly \nfocus on threats arising from user prompts (eg prompt injection attack) and model\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaAdaptive attacks break defenses against indirect prompt injection\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.06493&hl=en&sa=X&d=11620600554058339422&ei=epgmaO_IGbOi6rQPvJGpyAE&scisig=AAZF9b98hBUbxbYmqbim6r0ptoY6&oi=scholaralrt&hist=ylyK0_8AAAAJ:4436498698466669065:AAZF9b-6dRec6PGUxNGKd2t3_e20&html=&pos=0&folt=cit", "author": ["Richard Fang"], "ref": ["3 new citations to articles by Richard Fang"]}
{"title": "Concept-Level Explainability for Auditing & Steering LLM Responses", "first_label": ["LLM"], "second_label": [], "data": "K Amara, R Sevastjanova, M El-Assady\\xc2\\xa0- arXiv preprint arXiv:2505.07610, 2025\nAs large language models (LLMs) become widely deployed, concerns about their \nsafety and alignment grow. An approach to steer LLM behavior, such as mitigating \nbiases or defending against jailbreaks, is to identify which parts of a prompt influence \nspecific aspects of the model's output. Token-level attribution methods offer a \npromising solution, but still struggle in text generation, explaining the presence of \neach token in the output separately, rather than the underlying semantics of the\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaLlm agents can autonomously hack websites\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.07610&hl=en&sa=X&d=2487114209165587400&ei=epgmaO_IGbOi6rQPvJGpyAE&scisig=AAZF9b_MdyjKZG1aOlo4TZWZliFE&oi=scholaralrt&hist=ylyK0_8AAAAJ:4436498698466669065:AAZF9b-6dRec6PGUxNGKd2t3_e20&html=&pos=1&folt=cit", "author": ["Richard Fang"], "ref": ["3 new citations to articles by Richard Fang"]}
{"title": "RedTeamLLM: an Agentic AI framework for offensive security", "first_label": ["LLM"], "second_label": ["Agent"], "data": "B Challita, P Parrend\\xc2\\xa0- arXiv preprint arXiv:2505.06913, 2025\nFrom automated intrusion testing to discovery of zero-day attacks before software \nlaunch, agentic AI calls for great promises in security engineering. This strong \ncapability is bound with a similar threat: the security and research community must \nbuild up its models before the approach is leveraged by malicious actors for \ncybercrime. We therefore propose and evaluate RedTeamLLM, an integrated \narchitecture with a comprehensive security model for automatization of pentest tasks\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaLlm agents can autonomously exploit one-day vulnerabilities\\xe2\\x80\\xac  \n \nThis message was sent by Google Scholar because you\\'re following new citations to articles written by \nRichard Fang\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.06913&hl=en&sa=X&d=1781537178743348051&ei=epgmaO_IGbOi6rQPvJGpyAE&scisig=AAZF9b944_vuiLJ7EQ2Pt44N5VHt&oi=scholaralrt&hist=ylyK0_8AAAAJ:4436498698466669065:AAZF9b-6dRec6PGUxNGKd2t3_e20&html=&pos=2&folt=cit", "author": ["Richard Fang"], "ref": ["3 new citations to articles by Richard Fang"]}
{"title": "A Preliminary Study of Large Language Models for Multilingual Vulnerability Detection", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Detection"], "data": "J Yu, H Shu, M Fu, D Wang, C Tantithamthavorn\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nDeep learning-based approaches, particularly those leveraging pre-trained \nlanguage models (PLMs), have shown promise in automated software vulnerability \ndetection. However, existing methods are predominantly limited to specific\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.07376&hl=en&sa=X&d=16237279870506110674&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b8OUOupldlBlzE8sLhC_-XL&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=0&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Richard Fang - new related research", "Quang-Cuong Bui - new related research", "Thanh Le-Cong - new related research", "Xin ZHOU - new related research", "Hong Jin Kang - new related research"]}
{"title": "BinMetric: A Comprehensive Binary Analysis Benchmark for Large Language Models", "first_label": ["LLM"], "second_label": [], "data": "X Shang, G Chen, S Cheng, B Wu, L Hu, G Li, W Zhang\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nBinary analysis remains pivotal in software security, offering insights into compiled \nprograms without source code access. As large language models (LLMs) continue to \nexcel in diverse language understanding and generation tasks, their potential in\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.07360&hl=en&sa=X&d=4497467352720937962&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b-wRHbIxq20UNsHD11L2vlG&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=1&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Xin ZHOU - new related research", "Hong Jin Kang - new related research"]}
{"title": "Benchmarking and Revisiting Code Generation Assessment: A Mutation-Based Approach", "first_label": ["Code"], "second_label": ["Generation"], "data": "L Wang, T Li, X Xie, Y Zhi, J Wang, C Shen\\xc2\\xa0- arXiv preprint arXiv:2505.06880, 2025\nCode Large Language Models (CLLMs) have exhibited outstanding performance in \nprogram synthesis, attracting the focus of the research community. The evaluation of \nCLLM's program synthesis capability has generally relied on manually curated\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.06880&hl=en&sa=X&d=14741036642597810521&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b-XtwkjbmK5M8jMYEwh_fbQ&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=2&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Xin ZHOU - new related research"]}
{"title": "Enhancing Large Language Models with Faster Code Preprocessing for Vulnerability Detection", "first_label": ["Vulnerabilities", "LLM", "Code"], "second_label": ["Detection"], "data": "J Gon\\xc3\\xa7alves, M Silva, E Maia, I Pra\\xc3\\xa7a\\xc2\\xa0- arXiv preprint arXiv:2505.05600, 2025\nThe application of Artificial Intelligence has become a powerful approach to detecting \nsoftware vulnerabilities. However, effective vulnerability detection relies on \naccurately capturing the semantic structure of code and its contextual relationships\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.05600&hl=en&sa=X&d=8984895983797652308&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b9kKWHJJ0mX50MBHr5__ZhG&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=3&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Richard Fang - new related research", "Quang-Cuong Bui - new related research", "2 new citations to articles by Xin ZHOU", "Xin ZHOU - new related research", "Hong Jin Kang - new related research"]}
{"title": "Fault localization of AI-enabled cyber-physical systems by exploiting temporal neuron activation", "first_label": ["Fault Localization"], "second_label": ["Exploit", "Localization"], "data": "D Lyu, Y Li, Z Zhang, P Arcaini, XY Zhang, F Ishikawa\\xe2\\x80\\xa6\\xc2\\xa0- Journal of Systems and\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nModern cyber\\xe2\\x80\\x93physical systems (CPS) are evolving to integrate deep neural \nnetworks (DNNs) as controllers, leading to the emergence of AI-enabled CPSs. An \ninadequately trained DNN controller may produce incorrect control actions, exposing\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0164121225001438&hl=en&sa=X&d=3286846770327067741&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b-jUE3fT364wIMjAbdvLNMM&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=4&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "Abhik Roychoudhury - new related research"]}
{"title": "PRIMG: Efficient LLM-driven Test Generation Using Mutant Prioritization", "first_label": ["LLM", "Software Testing"], "second_label": ["Generation"], "data": "MS Bouafif, M Hamdaqa, E Zulkoski\\xc2\\xa0- arXiv preprint arXiv:2505.05584, 2025\nMutation testing is a widely recognized technique for assessing and enhancing the \neffectiveness of software test suites by introducing deliberate code mutations. \nHowever, its application often results in overly large test suites, as developers\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.05584&hl=en&sa=X&d=11403797073407320761&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b86CScVryKKGQAVQRmcR_df&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=5&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research", "4 new citations to articles by Bach Le", "Hong Jin Kang - new related research"]}
{"title": "How Are We Doing With Using AI-Based Programming Assistants For Privacy-Related Code Generation? The Developers' Experience", "first_label": ["Code"], "second_label": ["Generation"], "data": "K Madampe, J Grundy, N Arachchilage - 2025\nWith the popularising of generative AI, the existence of AI-based programming \nassistants for developers is no surprise. Developers increasingly use them for their \nwork, including generating code to fulfil the data protection requirements (privacy) of\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://nzjohng.github.io/publications/papers/ease2025.pdf&hl=en&sa=X&d=1058336382261864454&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b9zWSaNpdWSpSL95WLFQ6TS&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=7&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "Mining App Reviews for User Feedback Analysis in Requirements Engineering: A Project Report", "first_label": [], "second_label": [], "data": "Q Motger, M Oriol, M Tiessler, X Franch, J Marco - 2025\nMining app reviews has emerged as a valuable practice in requirements \nengineering, providing insights into feature usage trends, user satisfaction, and \nemerging software issues. While recent advances in natural language processing\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nDavid Lo\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://ceur-ws.org/Vol-3959/NLP4RE-short1.pdf&hl=en&sa=X&d=4227832458905918277&ei=epgmaPGPIOG_6rQP0ufy2AQ&scisig=AAZF9b9gUY47fyqc11MPWu960oyi&oi=scholaralrt&hist=ylyK0_8AAAAJ:5865787842749446205:AAZF9b9CiGf-firBvlixUlAEJTz9&html=&pos=8&folt=rel", "author": ["David Lo"], "ref": ["David Lo - new related research"]}
{"title": "TeeDFuzzer: Fuzzing Trusted Execution Environment", "first_label": ["Fuzzing"], "second_label": [], "data": "S Wen, L Xu, L Tian, S Liu, Y Ding\\xc2\\xa0- Electronics, 2025\nThe Trusted Execution Environment (TEE) is crucial for safeguarding the ecosystem \nof embedded systems. It uses isolation to minimize the TCB (Trusted Computing \nBase) and protect sensitive software. It is vital because devices handle vast\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://www.mdpi.com/2079-9292/14/8/1674&hl=en&sa=X&d=17000003502334375443&ei=epgmaKvhJJmD6rQPm8iIuAU&scisig=AAZF9b_cWX7Aqu8F3yi_nJDEp3Ce&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AAZF9b9l_z1CTdTcNTkZbRX9RLem&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "HScheduler: An execution history-based seed scheduling strategy for hardware fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "Z Guo, Y Lv, N Cui, L Chen, G Shi\\xc2\\xa0- Computers & Security, 2025\nThe recent emergence of hardware fuzzing has introduced significant advancements \nin hardware verification. However, the lack of an efficient seed (input for fuzzing) \nscheduling mechanism severely affects its performance. In this paper, we propose\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S0167404825001671&hl=en&sa=X&d=7181585585593368656&ei=epgmaKvhJJmD6rQPm8iIuAU&scisig=AAZF9b-MdMTIsACs-TsLu7a4u5O5&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AAZF9b9l_z1CTdTcNTkZbRX9RLem&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Fuzzing Space Communication Protocols", "first_label": ["Fuzzing"], "second_label": [], "data": "S Havermans, L Baumg\\xc3\\xa4rtner, J Roberts, M Wallum\\xe2\\x80\\xa6\nSpace systems are critical assets and protecting them against cyberattacks is a \nparamount challenge that has received limited attention. In particular, it is \nfundamental to secure spacecraft communications by identifying and removing\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://software.imdea.org/~juanca/papers/spacefuzz_spacesec25.pdf&hl=en&sa=X&d=964000194933772866&ei=epgmaKvhJJmD6rQPm8iIuAU&scisig=AAZF9b9To-YtFkNH0V2NeHA65cZP&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AAZF9b9l_z1CTdTcNTkZbRX9RLem&html=&pos=2&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "WildSync: Automated Fuzzing Harness Synthesis via Wild API Usage Recovery", "first_label": ["Fuzzing"], "second_label": [], "data": "WEIC WU, S NAGY, C HAUSER - 2025\nAuthors' Contact Information: Wei-Cheng Wu, Dartmouth College, Hanover, USA, wei-\ncheng. wu. gr@ dartmouth. edu; Stefan Nagy, University of Utah, Salt Lake City, USA, \nstefan. nagy@ utah. edu; Christophe Hauser, Dartmouth College, Hanover, USA\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://users.cs.utah.edu/~snagy/papers/25ISSTA.pdf&hl=en&sa=X&d=3125007074729669279&ei=epgmaKvhJJmD6rQPm8iIuAU&scisig=AAZF9b8Pijs9BnZif9GfvBHcFCPy&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AAZF9b9l_z1CTdTcNTkZbRX9RLem&html=&pos=3&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research", "Hong Jin Kang - new related research"]}
{"title": "Scalable Language Agnostic Taint Tracking Using Explicit Data Dependencies", "first_label": [], "second_label": [], "data": "SDB Effendi, X Pinho, AM Dreyer, F Yamaguchi\nTaint analysis using explicit whole-program data-dependence graphs is powerful for \nvulnerability discovery but faces two major challenges. First, accurately modeling \ntaint propagation through calls to external library procedures requires extensive \nmanual annotations, which becomes impractical for large ecosystems. Second, the \nsheer size of whole-program graph representations leads to serious scalability and \nperformance issues, particularly when quick analysis is needed in continuous\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaBugsinpy: a database of existing bugs in python programs to\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac  \n \nThis message was sent by Google Scholar because you\\'re following new citations to articles written by \nHong Jin Kang\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://davidbakereffendi.github.io/assets/pdf/preprint__Scalable_Language_Agnostic_Taint_Tracking_Using_Explicit_Data_Dependencies.pdf&hl=en&sa=X&d=10581431590711406049&ei=epgmaMuoHIjGieoPjfypkA8&scisig=AAZF9b87NjtT_3wVRqfhZwB_FG4R&oi=scholaralrt&hist=ylyK0_8AAAAJ:4851239734318863641:AAZF9b8LH3KLAxOt2g9Q0Um21N4o&html=&pos=0&folt=cit", "author": ["Hong Jin Kang"], "ref": ["1 new citation to articles by Hong Jin Kang", "Hong Jin Kang - new related research"]}
{"title": "From Bias To Improved Prompts: A Case Study of Bias Mitigation of Clone Detection Models", "first_label": [], "second_label": ["Detection"], "data": "QH Chen, L Jiang, I Ahmed\\xc2\\xa0- arXiv preprint arXiv:2505.05679, 2025\nThe issue of clone code has persisted in software engineering, primarily because \ndevelopers often copy and paste code segments. This common practice has \nelevated the importance of clone code detection, garnering attention from both \nsoftware engineering researchers and industry professionals. Their collective \nconcern arises from the potential negative impacts that clone code can have on \nsoftware quality. The emergence of powerful Generative Large Language Models\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaRefining chatgpt-generated code: Characterizing and mitigating\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.05679&hl=en&sa=X&d=4316617918279412683&ei=epgmaLjXHaCRieoP9dWb-As&scisig=AAZF9b8CzWbRgW9geiuKdb6lVMak&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AAZF9b-CBry8NrRagz6L4gSOAv5X&html=&pos=0&folt=cit", "author": ["Bach Le"], "ref": ["4 new citations to articles by Bach Le", "1 new citation to articles by Thanh Le-Cong"]}
{"title": "Decentralised Finance: Critical Perspectives", "first_label": [], "second_label": [], "data": "L Sauce - 2025\nSince the inception of Bitcoin in 2009, cryptoassets and decentralised finance (DeFi) \nhave become a multi-trillion-dollar industry, with a growing number of users, \nentrepreneurs, investment funds and institutional investors all over the world. This \nhas led to understandably high levels of attention from scholars, the media, and \npolicymakers, but much of the writing on decentralised finance is polarised or \npolemical. In contrast, this book provides a balanced, scholarly and sober\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaSmart contract development: Challenges and opportunities\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://books.google.com/books%3Fhl%3Den%26lr%3Dlang_en%26id%3DvpFcEQAAQBAJ%26oi%3Dfnd%26pg%3DPA6%26ots%3Dn8ifdvLY_o%26sig%3DgPnprhWK5nGqhZFC_sZcEEoI8qM&hl=en&sa=X&d=5415359344657680708&ei=epgmaLjXHaCRieoP9dWb-As&scisig=AAZF9b90LDodMrUXB2CHBtDRRwoE&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AAZF9b-CBry8NrRagz6L4gSOAv5X&html=&pos=2&folt=cit", "author": ["Bach Le"], "ref": ["4 new citations to articles by Bach Le"]}
{"title": "\\xd1\\x81\\xd1\\x82\\xd0\\xb0\\xd1\\x82\\xd1\\x8c\\xd0\\xb8: \\xd0\\x9d\\xd0\\xb0\\xd0\\xb4\\xd0\\xb5\\xd0\\xb6\\xd0\\xbd\\xd0\\xb0\\xd1\\x8f \\xd0\\xbe\\xd1\\x82\\xd1\\x81\\xd0\\xbb\\xd0\\xb5\\xd0\\xb6\\xd0\\xb8\\xd0\\xb2\\xd0\\xb0\\xd0\\xb5\\xd0\\xbc\\xd0\\xbe\\xd1\\x81\\xd1\\x82\\xd1\\x8c \\xd0\\xb8 \\xd1\\x81\\xd0\\xb5\\xd1\\x80\\xd1\\x82\\xd0\\xb8\\xd1\\x84\\xd0\\xb8\\xd0\\xba\\xd0\\xb0\\xd1\\x86\\xd0\\xb8\\xd1\\x8f \\xd0\\xb2\\xd0\\xbe\\xd1\\x81\\xd1\\x81\\xd1\\x82\\xd0\\xb0\\xd0\\xbd\\xd0\\xbe\\xd0\\xb2\\xd0\\xbb\\xd0\\xb5\\xd0\\xbd\\xd0\\xbd\\xd1\\x8b\\xd1\\x85 \\xd0\\xbc\\xd0\\xb5\\xd0\\xb4\\xd0\\xb8\\xd1\\x86\\xd0\\xb8\\xd0\\xbd\\xd1\\x81\\xd0\\xba\\xd0\\xb8\\xd1\\x85 \\xd0\\xb8\\xd0\\xb7\\xd0\\xb4\\xd0\\xb5\\xd0\\xbb\\xd0\\xb8\\xd0\\xb9 \\xd1\\x81 \\xd0\\xb8\\xd1\\x81\\xd0\\xbf\\xd0\\xbe\\xd0\\xbb\\xd1\\x8c\\xd0\\xb7\\xd0\\xbe\\xd0\\xb2\\xd0\\xb0\\xd0\\xbd\\xd0\\xb8\\xd0\\xb5\\xd0\\xbc \\xd0\\xb4\\xd0\\xb8\\xd0\\xbd\\xd0\\xb0\\xd0\\xbc\\xd0\\xb8\\xd1\\x87\\xd0\\xb5\\xd1\\x81\\xd0\\xba\\xd0\\xb8 \\xd0\\xba\\xd0\\xbe\\xd0\\xbc\\xd0\\xbf\\xd0\\xbe\\xd0\\xbd\\xd1\\x83\\xd0\\xb5\\xd0\\xbc\\xd1\\x8b\\xd1\\x85 NFT", "first_label": [], "second_label": [], "data": "SA Gebreab, K Salah, R Jayaraman, J Zemerly\\xe2\\x80\\xa6\n\\xd0\\x9c\\xd0\\xb5\\xd0\\xb4\\xd0\\xb8\\xd1\\x86\\xd0\\xb8\\xd0\\xbd\\xd1\\x81\\xd0\\xba\\xd0\\xb8\\xd0\\xb5 \\xd1\\x83\\xd1\\x81\\xd1\\x82\\xd1\\x80\\xd0\\xbe\\xd0\\xb9\\xd1\\x81\\xd1\\x82\\xd0\\xb2\\xd0\\xb0 \\xd0\\xb8\\xd0\\xb3\\xd1\\x80\\xd0\\xb0\\xd1\\x8e\\xd1\\x82 \\xd1\\x80\\xd0\\xb5\\xd1\\x88\\xd0\\xb0\\xd1\\x8e\\xd1\\x89\\xd1\\x83\\xd1\\x8e \\xd1\\x80\\xd0\\xbe\\xd0\\xbb\\xd1\\x8c \\xd0\\xb2 \\xd0\\xb3\\xd0\\xbb\\xd0\\xbe\\xd0\\xb1\\xd0\\xb0\\xd0\\xbb\\xd1\\x8c\\xd0\\xbd\\xd0\\xbe\\xd0\\xb9 \\xd1\\x81\\xd0\\xb8\\xd1\\x81\\xd1\\x82\\xd0\\xb5\\xd0\\xbc\\xd0\\xb5 \n\\xd0\\xb7\\xd0\\xb4\\xd1\\x80\\xd0\\xb0\\xd0\\xb2\\xd0\\xbe\\xd0\\xbe\\xd1\\x85\\xd1\\x80\\xd0\\xb0\\xd0\\xbd\\xd0\\xb5\\xd0\\xbd\\xd0\\xb8\\xd1\\x8f, \\xd0\\xbd\\xd0\\xbe \\xd0\\xb8\\xd1\\x85 \\xd0\\xb2\\xd1\\x8b\\xd1\\x81\\xd0\\xbe\\xd0\\xba\\xd0\\xb0\\xd1\\x8f \\xd1\\x81\\xd1\\x82\\xd0\\xbe\\xd0\\xb8\\xd0\\xbc\\xd0\\xbe\\xd1\\x81\\xd1\\x82\\xd1\\x8c \\xd0\\xbf\\xd1\\x80\\xd0\\xb8\\xd0\\xb2\\xd0\\xb5\\xd0\\xbb\\xd0\\xb0 \\xd0\\xba \\xd0\\xb1\\xd0\\xbe\\xd0\\xbb\\xd0\\xb5\\xd0\\xb5 \\xd1\\x88\\xd0\\xb8\\xd1\\x80\\xd0\\xbe\\xd0\\xba\\xd0\\xbe\\xd0\\xbc\\xd1\\x83 \n\\xd0\\xb8\\xd1\\x81\\xd0\\xbf\\xd0\\xbe\\xd0\\xbb\\xd1\\x8c\\xd0\\xb7\\xd0\\xbe\\xd0\\xb2\\xd0\\xb0\\xd0\\xbd\\xd0\\xb8\\xd1\\x8e \\xd0\\xbe\\xd1\\x82\\xd1\\x80\\xd0\\xb5\\xd0\\xbc\\xd0\\xbe\\xd0\\xbd\\xd1\\x82\\xd0\\xb8\\xd1\\x80\\xd0\\xbe\\xd0\\xb2\\xd0\\xb0\\xd0\\xbd\\xd0\\xbd\\xd1\\x8b\\xd1\\x85 \\xd0\\xbc\\xd0\\xb5\\xd0\\xb4\\xd0\\xb8\\xd1\\x86\\xd0\\xb8\\xd0\\xbd\\xd1\\x81\\xd0\\xba\\xd0\\xb8\\xd1\\x85 \\xd1\\x83\\xd1\\x81\\xd1\\x82\\xd1\\x80\\xd0\\xbe\\xd0\\xb9\\xd1\\x81\\xd1\\x82\\xd0\\xb2 \\xd0\\xb2 \\xd0\\xba\\xd0\\xb0\\xd1\\x87\\xd0\\xb5\\xd1\\x81\\xd1\\x82\\xd0\\xb2\\xd0\\xb5 \n\\xd1\\x83\\xd1\\x81\\xd1\\x82\\xd0\\xbe\\xd0\\xb9\\xd1\\x87\\xd0\\xb8\\xd0\\xb2\\xd0\\xbe\\xd0\\xb9 \\xd0\\xb0\\xd0\\xbb\\xd1\\x8c\\xd1\\x82\\xd0\\xb5\\xd1\\x80\\xd0\\xbd\\xd0\\xb0\\xd1\\x82\\xd0\\xb8\\xd0\\xb2\\xd1\\x8b \\xd0\\xb4\\xd0\\xbb\\xd1\\x8f \\xd0\\xb1\\xd0\\xbe\\xd0\\xbb\\xd1\\x8c\\xd0\\xbd\\xd0\\xb8\\xd1\\x86 \\xd0\\xb8 \\xd0\\xbf\\xd0\\xb0\\xd1\\x86\\xd0\\xb8\\xd0\\xb5\\xd0\\xbd\\xd1\\x82\\xd0\\xbe\\xd0\\xb2 \\xd0\\xbf\\xd0\\xbe \\xd0\\xb2\\xd1\\x81\\xd0\\xb5\\xd0\\xbc\\xd1\\x83 \\xd0\\xbc\\xd0\\xb8\\xd1\\x80\\xd1\\x83. \\xd0\\x9e\\xd0\\xb4\\xd0\\xbd\\xd0\\xb0\\xd0\\xba\\xd0\\xbe \n\\xd1\\x80\\xd0\\xb5\\xd0\\xbf\\xd0\\xbe\\xd0\\xb7\\xd0\\xb8\\xd1\\x86\\xd0\\xb8\\xd0\\xbe\\xd0\\xbd\\xd0\\xb8\\xd1\\x80\\xd0\\xbe\\xd0\\xb2\\xd0\\xb0\\xd0\\xbd\\xd0\\xb8\\xd0\\xb5 \\xd0\\xb2\\xd0\\xbe\\xd1\\x81\\xd1\\x81\\xd1\\x82\\xd0\\xb0\\xd0\\xbd\\xd0\\xbe\\xd0\\xb2\\xd0\\xbb\\xd0\\xb5\\xd0\\xbd\\xd0\\xbd\\xd1\\x8b\\xd1\\x85 \\xd1\\x83\\xd1\\x81\\xd1\\x82\\xd1\\x80\\xd0\\xbe\\xd0\\xb9\\xd1\\x81\\xd1\\x82\\xd0\\xb2 \\xd0\\xbd\\xd0\\xb0 \\xd1\\x80\\xd1\\x8b\\xd0\\xbd\\xd0\\xba\\xd0\\xb5 \\xd1\\x81\\xd0\\xbe\\xd0\\xbf\\xd1\\x80\\xd0\\xbe\\xd0\\xb2\\xd0\\xbe\\xd0\\xb6\\xd0\\xb4\\xd0\\xb0\\xd0\\xb5\\xd1\\x82\\xd1\\x81\\xd1\\x8f \n\\xd1\\x80\\xd1\\x8f\\xd0\\xb4\\xd0\\xbe\\xd0\\xbc \\xd0\\xbf\\xd1\\x80\\xd0\\xbe\\xd0\\xb1\\xd0\\xbb\\xd0\\xb5\\xd0\\xbc, \\xd0\\xb2\\xd0\\xba\\xd0\\xbb\\xd1\\x8e\\xd1\\x87\\xd0\\xb0\\xd1\\x8f \\xd0\\xbf\\xd1\\x80\\xd0\\xbe\\xd0\\xb1\\xd0\\xbb\\xd0\\xb5\\xd0\\xbc\\xd1\\x8b \\xd0\\xba\\xd0\\xb0\\xd1\\x87\\xd0\\xb5\\xd1\\x81\\xd1\\x82\\xd0\\xb2\\xd0\\xb0 \\xd0\\xb8 \\xd0\\xb1\\xd0\\xb5\\xd0\\xb7\\xd0\\xbe\\xd0\\xbf\\xd0\\xb0\\xd1\\x81\\xd0\\xbd\\xd0\\xbe\\xd1\\x81\\xd1\\x82\\xd0\\xb8, \\xd0\\xb0 \\xd1\\x82\\xd0\\xb0\\xd0\\xba\\xd0\\xb6\\xd0\\xb5 \\xd1\\x80\\xd0\\xb8\\xd1\\x81\\xd0\\xba\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaSmart contract development: Challenges and opportunities\\xe2\\x80\\xac  \n \nThis message was sent by Google Scholar because you\\'re following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://metarenessans.ru/upload/iblock/d57/ekryvjb2abgt3caedcoidlbxits44zmr.pdf&hl=en&sa=X&d=7462717585644795597&ei=epgmaLjXHaCRieoP9dWb-As&scisig=AAZF9b_VIwvYlFHtY_9EKAc6PQds&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AAZF9b-CBry8NrRagz6L4gSOAv5X&html=&pos=3&folt=cit", "author": ["Bach Le"], "ref": ["4 new citations to articles by Bach Le"]}
{"title": "LiteLMGuard: Seamless and Lightweight On-Device Prompt Filtering for Safeguarding Small Language Models against Quantization-induced Risks and\\xc2\\xa0\\xe2\\x80\\xa6", "first_label": ["LLM"], "second_label": [], "data": "K Nakka, J Dani, A Mondal, N Saxena\\xc2\\xa0- arXiv preprint arXiv:2505.05619, 2025\nThe growing adoption of Large Language Models (LLMs) has influenced the \ndevelopment of their lighter counterparts-Small Language Models (SLMs)-to enable \non-device deployment across smartphones and edge devices. These SLMs offer\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.05619&hl=en&sa=X&d=9591490110935523272&ei=epgmaPD7KNG5ieoPz9mssA0&scisig=AAZF9b9oEmx3O1xfAtuBkDwReUGH&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=0&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Ctrl-Z: Controlling AI Agents via Resampling", "first_label": [], "second_label": ["Agent"], "data": "A Bhatt, C Rushing, A Kaufman, T Tracy, V Georgiev\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nControl evaluations measure whether monitoring and security protocols for AI \nsystems prevent intentionally subversive AI models from causing harm. Our work \npresents the first control evaluation performed in an agent environment. We construct\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.10374&hl=en&sa=X&d=16067452217130556604&ei=epgmaPD7KNG5ieoPz9mssA0&scisig=AAZF9b_CZrnkDEw4aBYaVzX1m4ye&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=1&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "AgentXploit: End-to-End Redteaming of Black-Box AI Agents", "first_label": [], "second_label": ["Agent"], "data": "Z Wang, V Siu, Z Ye, T Shi, Y Nie, X Zhao, C Wang\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nThe strong planning and reasoning capabilities of Large Language Models (LLMs) \nhave fostered the development of agent-based systems capable of leveraging \nexternal tools and interacting with increasingly complex environments. However\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.05849&hl=en&sa=X&d=13145039506086791936&ei=epgmaPD7KNG5ieoPz9mssA0&scisig=AAZF9b_5aWzkLQOK0HBWClMmbpt1&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=2&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Internet of Agents: Fundamentals, Applications, and Challenges", "first_label": [], "second_label": ["Agent"], "data": "Y Wang, S Guo, Y Pan, Z Su, F Chen, TH Luan, P Li\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nWith the rapid proliferation of large language models and vision-language models, AI \nagents have evolved from isolated, task-specific systems into autonomous, \ninteractive entities capable of perceiving, reasoning, and acting without human\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.07176&hl=en&sa=X&d=14409917598196172363&ei=epgmaPD7KNG5ieoPz9mssA0&scisig=AAZF9b_hGGHtDwzYQ7lpVhr8hQLE&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=3&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "RAP-SM: Robust Adversarial Prompt via Shadow Models for Copyright Verification of Large Language Models", "first_label": ["Verification", "LLM"], "second_label": [], "data": "Z Xu, Z Wang, M Li, W Xing, C Hu, C Zhi, M Han\\xc2\\xa0- arXiv preprint arXiv:2505.06304, 2025\nRecent advances in large language models (LLMs) have underscored the \nimportance of safeguarding intellectual property rights through robust fingerprinting \ntechniques. Traditional fingerprint verification approaches typically focus on a single\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.06304&hl=en&sa=X&d=14859749774004784152&ei=epgmaPD7KNG5ieoPz9mssA0&scisig=AAZF9b9uaqvBpwBGnFJY1JpNyzma&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=5&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Enhancing Web Agents with Explicit Rollback Mechanisms", "first_label": [], "second_label": ["Agent"], "data": "Z Zhang, T Fang, K Ma, W Yu, H Zhang, H Mi, D Yu\\xc2\\xa0- arXiv preprint arXiv:2504.11788, 2025\nWith recent advancements in large language models, web agents have been greatly \nimproved. However, dealing with complex and dynamic web environments requires \nmore advanced planning and search abilities. Previous studies usually adopt a\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nRichard Fang\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.11788%3F&hl=en&sa=X&d=12132703109484744215&ei=epgmaPD7KNG5ieoPz9mssA0&scisig=AAZF9b9OqC4elj1elUsQol8AAHKN&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=7&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "JustinANN: Realistic Test Generation for Java Programs Driven by Annotations", "first_label": ["Software Testing"], "second_label": ["Generation"], "data": "B Cui, R Qu, J Zhang\\xc2\\xa0- arXiv preprint arXiv:2505.05715, 2025\nAutomated test case generation is important. However, the automatically generated \ntest input does not always make sense, and the automated assertion is difficult to \nvalidate against the program under test. In this paper, we propose JustinANN, a\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nQuang-Cuong Bui\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.05715&hl=en&sa=X&d=9341718526371207144&ei=epgmaPuqI8yO6rQP0Kyc0AU&scisig=AAZF9b_a3c90rKqtJc5-fxFV2sgy&oi=scholaralrt&hist=ylyK0_8AAAAJ:11088443020050739259:AAZF9b_dlaF_l6JD6R93aQP1v_a_&html=&pos=3&folt=rel", "author": ["Quang-Cuong Bui"], "ref": ["Quang-Cuong Bui - new related research"]}
{"title": "Automated Generation of Commit Messages in Software Repositories", "first_label": ["Commit Message"], "second_label": ["Generation"], "data": "VK Palakodeti, A Heydarnoori\\xc2\\xa0- arXiv preprint arXiv:2504.12998, 2025\nCommit messages are crucial for documenting software changes, aiding in program \ncomprehension and maintenance. However, creating effective commit messages is \noften overlooked by developers due to time constraints and varying levels of\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nThanh Le-Cong\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.12998&hl=en&sa=X&d=6245184434680463467&ei=epgmaKSCG62GieoP4qyfoAo&scisig=AAZF9b81AlBZEGqRJJgDDs8b3y4i&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AAZF9b_1MT--9phVV-34dqGZeQFI&html=&pos=2&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "Hong Jin Kang - new related research"]}
{"title": "Dataset for Legal Question Answering System in the Indian Judiciary Context", "first_label": [], "second_label": [], "data": "K Veningston, A Mishra\\xc2\\xa0- Data in Brief, 2025\nLegal documents, such as court judgments and statutes, are vital for understanding \njudicial decisions, legal principles, and procedural details. However, these \ndocuments are often dense, complex, and abundant, making it challenging for \nlawyers, researchers, and citizens to quickly and easily locate and retrieve relevant \ninformation. The Legal Question Answering (LQA)[1] task involves developing \nsystems that can automatically answer legal questions based on relevant legal\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaExploring Parameter-Efficient Fine-Tuning Techniques for Code\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac  \n \nThis message was sent by Google Scholar because you\\'re following new citations to articles written by \nXin ZHOU\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://www.sciencedirect.com/science/article/pii/S2352340925003774&hl=en&sa=X&d=13572057182322904923&ei=epgmaO2iJ_ynieoPhK2buAM&scisig=AAZF9b9lO3Redo68wjh5-9r5HL3F&oi=scholaralrt&hist=ylyK0_8AAAAJ:15035864585353249078:AAZF9b__fNdZeFj1p33oPi7SBv6G&html=&pos=1&folt=cit", "author": ["Xin ZHOU"], "ref": ["2 new citations to articles by Xin ZHOU"]}
{"title": "Retrieval Augmented Generation Fine-Tuned LLM Model for Code Recommendations to Mitigate Lock Contention", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "A Shawon, R Liscano, A Azim, V Sundaresan\\xe2\\x80\\xa6\\xc2\\xa0- Companion of the 16th ACM\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nLock contention performance faults can lead to degradation in the performance of \nsoftware applications. Unlike software bugs, per-formance faults do not lead to \nfailures and application crashes but surface as a degradation in the response and\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/abs/10.1145/3680256.3721324&hl=en&sa=X&d=9066686008189024422&ei=epgmaIiuKo2Z6rQP8OTB4AI&scisig=AAZF9b_z8isVs0s9J_P2VPM3lUR4&oi=scholaralrt&hist=ylyK0_8AAAAJ:16898579961534012346:AAZF9b8mlk_JgC2UbDdCdga5r9UH&html=&pos=5&folt=rel", "author": ["Xin ZHOU"], "ref": ["Xin ZHOU - new related research"]}
{"title": "Can Long-Context Language Models Solve Repository-Level Code Generation?", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "Y PENG, ZZ Wang, D Fried\\xc2\\xa0- LTI Student Research Symposium 2025\nWith the advance of real-world tasks that necessitate increasingly long contexts, \nrecent language models (LMs) have begun to support longer context windows. One \nparticularly complex task is repository-level code generation, where retrieval\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nBach Le\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://openreview.net/pdf%3Fid%3DpmcWo9DtDw&hl=en&sa=X&d=13063763947226413069&ei=epgmaKGTGJaM6rQPmLK18A4&scisig=AAZF9b9atphr1WTCjx4gTyjUat33&oi=scholaralrt&hist=ylyK0_8AAAAJ:4328508672846969495:AAZF9b9vPVpCbQIEUDOQKatBd4_T&html=&pos=2&folt=rel", "author": ["Bach Le"], "ref": ["Bach Le - new related research"]}
{"title": "CBGF: Callback Coverage Guided Fuzzing", "first_label": ["Fuzzing"], "second_label": [], "data": "H Hwang, D Moon\\xc2\\xa0- IEEE Access, 2025\nCallback functions are widely used across programming languages, libraries, and \noperating systems. While offering flexible software design, these mechanisms \nintroduce inherently complex execution flows that can serve as potential attack\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/6287639/6514899/10965623.pdf&hl=en&sa=X&d=3130441307734811739&ei=epgmaIfmK6mrieoP_fOcuAU&scisig=AAZF9b_FLqC17adWphONw1LQxaLM&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=1&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Abhik Roychoudhury - new related research"]}
{"title": "VLM-Fuzz: Vision Language Model Assisted Recursive Depth-first Search Exploration for Effective UI Testing of Android Apps", "first_label": ["LLM", "Fuzzing", "Software Testing"], "second_label": ["Search"], "data": "BF Demissie, YN Tun, LK Shar, M Ceccato\\xc2\\xa0- arXiv preprint arXiv:2504.11675, 2025\nTesting Android apps effectively requires a systematic exploration of the app's \npossible states by simulating user interactions and system events. While existing \napproaches have proposed several fuzzing techniques to generate various text\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.11675&hl=en&sa=X&d=1988321903897613415&ei=epgmaIfmK6mrieoP_fOcuAU&scisig=AAZF9b97gghXTQnt2wHdcBD6wIbH&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=2&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "Abhik Roychoudhury - new related research"]}
{"title": "Everything You Wanted to Know About LLM-based Vulnerability Detection But Were Afraid to Ask", "first_label": ["Vulnerabilities", "LLM"], "second_label": ["Detection"], "data": "Y Li, X Li, H Wu, M Xu, Y Zhang, X Cheng, F Xu\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nLarge Language Models are a promising tool for automated vulnerability detection, \nthanks to their success in code generation and repair. However, despite widespread \nadoption, a critical question remains: Are LLMs truly effective at detecting real-world\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.13474&hl=en&sa=X&d=3576198370349911873&ei=epgmaIfmK6mrieoP_fOcuAU&scisig=AAZF9b_knlGBPGica-ikm1KSsK8J&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=3&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "ELAB: Extensive LLM Alignment Benchmark in Persian Language", "first_label": ["LLM"], "second_label": [], "data": "Z Pourbahman, F Rajabi, M Sadeghi, O Ghahroodi\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nThis paper presents a comprehensive evaluation framework for aligning Persian \nLarge Language Models (LLMs) with critical ethical dimensions, including safety, \nfairness, and social norms. It addresses the gaps in existing LLM evaluation\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.12553%3F&hl=en&sa=X&d=4417832566291085341&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b_MvcNXVZjMHp8SP_hsJQNp&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=0&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "A4FL: Federated Adversarial Defense via Adversarial Training and Pruning Against Backdoor Attack", "first_label": [], "second_label": [], "data": "B Li, M Hamid, M Saleem, M Aman\\xc2\\xa0- IEEE Access, 2025\nBackdoor attacks threaten federated learning (FL) models, where malicious \nparticipants embed hidden triggers into local models during training. These triggers \ncan compromise crucial applications, such as autonomous systems, when they\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/iel8/6287639/6514899/10992684.pdf&hl=en&sa=X&d=4691259454218143835&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b-NVXh_0LVfWkgmGPYIRTtu&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=1&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "BadLingual: A Novel Lingual-Backdoor Attack against Large Language Models", "first_label": ["LLM"], "second_label": [], "data": "Z Wang, H Li, R Zhang, W Jiang, K Chen, T Zhang\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nIn this paper, we present a new form of backdoor attack against Large Language \nModels (LLMs): lingual-backdoor attacks. The key novelty of lingual-backdoor attacks \nis that the language itself serves as the trigger to hijack the infected LLMs to generate\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.03501&hl=en&sa=X&d=15489349756851264058&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b_j_X5MMHAf2tokb2xerP6r&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=2&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Understanding and Mitigating Data-Centric Vulnerabilities in Modern AI Systems", "first_label": ["Vulnerabilities"], "second_label": [], "data": "Y Zeng - 2025\nModern artificial intelligence (AI) systems, trained on vast internet-scale datasets, \ndemonstrate remarkable performance and emergent capabilities. However, this \nreliance on large datasets that are expensive or difficult to quality-control exposes AI\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://vtechworks.lib.vt.edu/bitstreams/969ecb3a-7e70-4cf2-af1c-b29899289d08/download&hl=en&sa=X&d=2645522495761717159&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b_VLMc2u9aan2qH0PVvaGka&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=3&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Secure Transfer Learning: Training Clean Models Against Backdoor in (Both) Pre-trained Encoders and Downstream Datasets", "first_label": ["Code"], "second_label": [], "data": "Y Zhang, Y Zhou, T Li, M Li, S Hu, W Luo, LY Zhang\\xc2\\xa0- arXiv preprint arXiv:2504.11990, 2025\nTransfer learning from pre-trained encoders has become essential in modern \nmachine learning, enabling efficient model adaptation across diverse tasks. \nHowever, this combination of pre-training and downstream adaptation creates an\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.11990&hl=en&sa=X&d=85981534375043028&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b-onv_zdOyfEcVxYwJ6H8X7&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=4&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Steering the CensorShip: Uncovering Representation Vectors for LLM\" Thought\" Control", "first_label": ["LLM"], "second_label": [], "data": "H Cyberey, D Evans\\xc2\\xa0- arXiv preprint arXiv:2504.17130, 2025\nLarge language models (LLMs) have transformed the way we access information. \nThese models are often tuned to refuse to comply with requests that are considered \nharmful and to produce responses that better align with the preferences of those who\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.17130&hl=en&sa=X&d=15371871009015193723&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b8EW3QbsTc18pFbrVjbazAC&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=5&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Cracking SQL Barriers: An LLM-based Dialect Transaltion System", "first_label": ["LLM"], "second_label": [], "data": "W Zhou, Y Gao, X Zhou, G Li\\xc2\\xa0- Proc. ACM Manag. Data, 2025\nAuthors' Contact Information: Wei Zhou, Shanghai Jiao Tong University, China, \nweizhoudb@ gmail. com; Yuyang Gao, Tsinghua University, China, 21373016@ \nbuaa. edu. cn; Xuanhe Zhou, Shanghai Jiao Tong University, China, zhouxh@ cs\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://dbgroup.cs.tsinghua.edu.cn/ligl/SIGMOD25-CrackSQL.pdf&hl=en&sa=X&d=824223224836212020&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b-rtjCRZ8P3fMzchSuEoMwi&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=6&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Facial recognition optimization based on adversarial sample generation in the field of artificial intelligence", "first_label": [], "second_label": ["Generation"], "data": "J Yang\\xc2\\xa0- Discover Artificial Intelligence, 2025\nFacial recognition systems in the artificial intelligence have potential threats from \nsample attacks and pose security risks. Thus, the research on facial adversarial \nsample generation based on ensemble learning is carried out. Firstly, the traditional\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s44163-025-00287-9&hl=en&sa=X&d=10808851424460689525&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b_3FCcM2z9DR70OxtnVVqRF&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=7&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "A Survey on Backdoor Threats in Large Language Models (LLMs): Attacks, Defenses, and Evaluation Methods", "first_label": ["LLM"], "second_label": [], "data": "Y Zhou, T Ni, WB Lee, Q Zhao - 2025\nLarge Language Models (LLMs) have achieved significantly advanced capabilities in \nunderstanding and generating human language text, gaining popularity over recent \nyears. Apart from their state-of-the-art natural language processing (NLP)\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nRichard Fang\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://media.sciltp.com/articles/2505000595/2505000595.pdf&hl=en&sa=X&d=16944278531338390120&ei=UfokaOXVO7yJieoPlKXb4AY&scisig=AAZF9b8BBVyJYe2-UG5J_DEMdPUH&oi=scholaralrt&hist=ylyK0_8AAAAJ:15287030194885030172:AAZF9b9ZGN1vUuxfG1GbOlvhloTS&html=&pos=8&folt=rel", "author": ["Richard Fang"], "ref": ["Richard Fang - new related research"]}
{"title": "Automated Static Vulnerability Detection via a Holistic Neuro-symbolic Approach", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "P Li, S Yao, JS Korich, C Luo, J Yu, Y Cao, J Yang\\xc2\\xa0- arXiv preprint arXiv:2504.16057, 2025\nStatic vulnerability detection is still a challenging problem and demands excessive \nhuman efforts, eg, manual curation of good vulnerability patterns. None of prior \nworks, including classic program analysis or Large Language Model (LLM)-based\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.16057&hl=en&sa=X&d=9834843443376334647&ei=UvokaPqpAZK26rQPmeqAiQw&scisig=AAZF9b-gtOoXgtzy_W6QmLnzx_l0&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=1&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Facilitating Trustworthy Human-Agent Collaboration in LLM-based Multi-Agent System oriented Software Engineering", "first_label": ["LLM"], "second_label": ["Agent"], "data": "K Ronanki\\xc2\\xa0- arXiv preprint arXiv:2505.04251, 2025\nMulti-agent autonomous systems (MAS) are better at addressing challenges that \nspans across multiple domains than singular autonomous agents. This holds true \nwithin the field of software engineering (SE) as well. The state-of-the-art research on\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.04251&hl=en&sa=X&d=6965781305808337609&ei=UvokaPqpAZK26rQPmeqAiQw&scisig=AAZF9b81r6yQh8_6GVLE4oLHpCWz&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=2&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Detecting data manipulation errors in android applications using scene-guided exploration", "first_label": [], "second_label": ["Detection"], "data": "S Liu, Y Zhou, W Yang, T Chen, H Gall\\xc2\\xa0- Empirical Software Engineering, 2025\nData manipulation functionalities (DMFs) refer to operations such as create, read, \nupdate and delete which are crucial for maintaining the integrity of Android \napplication (app) data. Existing testing techniques often fail to explicitly verify DMFs\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10664-025-10662-w&hl=en&sa=X&d=680114603958333685&ei=UvokaPqpAZK26rQPmeqAiQw&scisig=AAZF9b8bi9STuy3YS2r_8T_RXqko&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=3&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research", "1 new citation to articles by Abhik Roychoudhury", "David Lo - new related research"]}
{"title": "Identifying Root Cause of bugs by Capturing Changed Code Lines with Relational Graph Neural Networks", "first_label": ["Code", "Bug"], "second_label": ["Detection", "Graph"], "data": "J Zhang, S Guo, H Li, C Li, Y Chai, R Chen\\xc2\\xa0- arXiv preprint arXiv:2505.00990, 2025\nThe Just-In-Time defect prediction model helps development teams improve software \nquality and efficiency by assessing whether code changes submitted by developers \nare likely to introduce defects in real-time, allowing timely identification of potential\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2505.00990&hl=en&sa=X&d=17996198631274398381&ei=UvokaPqpAZK26rQPmeqAiQw&scisig=AAZF9b_S66ntoRzUw7soStgrJChb&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=4&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "Early Accessibility: Automating Alt-Text Generation for UI Icons During App Development", "first_label": [], "second_label": ["Generation"], "data": "S Haque, C Csallner\\xc2\\xa0- arXiv preprint arXiv:2504.13069, 2025\nAlt-text is essential for mobile app accessibility, yet UI icons often lack meaningful \ndescriptions, limiting accessibility for screen reader users. Existing approaches either \nrequire extensive labeled datasets, struggle with partial UI contexts, or operate post\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nHong Jin Kang\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2504.13069&hl=en&sa=X&d=15582642935887304547&ei=UvokaPqpAZK26rQPmeqAiQw&scisig=AAZF9b9rsHOA9yL385SiojMPuS4J&oi=scholaralrt&hist=ylyK0_8AAAAJ:17903213248891513419:AAZF9b_VfgOz15WyMBkfhPNIM3wy&html=&pos=5&folt=rel", "author": ["Hong Jin Kang"], "ref": ["Hong Jin Kang - new related research"]}
{"title": "MORepair: Teaching LLMs to Repair Code via Multi-Objective Fine-Tuning", "first_label": ["LLM", "Code"], "second_label": ["Repair"], "data": "B Yang, H Tian, J Ren, H Zhang, J Klein, T Bissyande\\xe2\\x80\\xa6\\xc2\\xa0- ACM Transactions on Software\\xc2\\xa0\\xe2\\x80\\xa6\nWithin the realm of software engineering, specialized tasks on code, such as \nprogram repair, present unique challenges, necessitating fine-tuning Large \nlanguage models (LLMs) to unlock state-of-the-art performance. Fine-tuning\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nThanh Le-Cong\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/abs/10.1145/3735129&hl=en&sa=X&d=11602434683763570091&ei=UfokaJC3M62GieoP4qyfoAo&scisig=AAZF9b9hvg_gvDqlwc2B7zK4TK5o&oi=scholaralrt&hist=ylyK0_8AAAAJ:4812769200119993430:AAZF9b_1MT--9phVV-34dqGZeQFI&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - new related research", "David Lo - new related research", "Xin ZHOU - new related research"]}
{"title": "CHIMERA: Fuzzing P4 Network Infrastructure for Multi-Plane Bug Detection and Vulnerability Discovery", "first_label": ["Vulnerabilities", "Fuzzing", "Bug"], "second_label": ["Detection"], "data": "J Kim, DJ Tian, BE Ujcich\\xc2\\xa0- 2025 IEEE Symposium on Security and Privacy (SP), 2025\nProgrammable network data planes, such as P4, offer flexibility in defining network \nforwarding behavior. However, such programmability introduces a new attack \nsurface for bugs and security vulnerabilities. Most P4 security research has focused\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://kjw6855.github.io/assets/pdf/sp25_kim_chimera.pdf&hl=en&sa=X&d=6094077905886690143&ei=UfokaJjxOJDIieoPn6y1iAQ&scisig=AAZF9b86dvBdClyFEIFpgKdNzAJ4&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AAZF9b9l_z1CTdTcNTkZbRX9RLem&html=&pos=0&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Yesterday Once MorE: Facilitating Linux Kernel Bug Reproduction via Reverse Fuzzing", "first_label": ["Fuzzing", "Bug"], "second_label": [], "data": "X Li, Y Kang, C Wu, D Liu, J Wang, Y Sun, Z Wu\\xe2\\x80\\xa6\\xc2\\xa0- IEEE Transactions on\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nThe Linux kernel remains vulnerable to numerous bugs, with approximately 65% \ndetected by Syzkaller lacking Proof-of-Concept (PoC), hampering risk mitigation \nefforts. These bugs, termed irreproducible kernel bugs, highlight the challenge of\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/10974508/&hl=en&sa=X&d=3315420953764714878&ei=UfokaJjxOJDIieoPn6y1iAQ&scisig=AAZF9b9-UXOL8xe-8kFgSaZ_qV7P&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AAZF9b9l_z1CTdTcNTkZbRX9RLem&html=&pos=1&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Using Historical Information for Fuzzing JavaScript Engines", "first_label": ["Fuzzing"], "second_label": [], "data": "BG de Oliveira, AT Endo, SR Vergilio\nJavaScript is a programming language commonly used to add interactivity and \ndynamic functionality to websites. It is a high-level, dynamically-typed language, well-\nsuited for building complex, client-side applications and supporting server-side\\xc2\\xa0\\xe2\\x80\\xa6\n \nThis message was sent by Google Scholar because you\\'re following new articles related to research by \nAbhik Roychoudhury\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://www.scitepress.org/Papers/2025/134177/134177.pdf&hl=en&sa=X&d=12017355669252469211&ei=UfokaJjxOJDIieoPn6y1iAQ&scisig=AAZF9b_j7bAjZmSfoWjcVwV7Oa3C&oi=scholaralrt&hist=ylyK0_8AAAAJ:12723761785867032729:AAZF9b9l_z1CTdTcNTkZbRX9RLem&html=&pos=4&folt=rel", "author": ["Abhik Roychoudhury"], "ref": ["Abhik Roychoudhury - new related research"]}
{"title": "Legal Analysis on the Legal Subject of AI-Generated Contract", "first_label": [], "second_label": [], "data": "W Su\nThe integration of artificial intelligence (AI) into legal technology, particularly in \ncontract drafting, presents both innovative potential and significant legal challenges. \nThis research focuses on the legal validity of AI-generated contracts under \nIndonesian law. While AI can efficiently generate comprehensive and standardized \nagreements, its lack of legal subjectivity raises questions about its capacity to enter \ninto binding contracts. By analyzing the Indonesian Civil Code, specifically Articles\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nCites: \\xe2\\x80\\xaaSmart contract development: Challenges and opportunities\\xe2\\x80\\xac  \n \nThis message was sent by Google Scholar because you\\'re following new citations to articles written by \nBach Le\n.\nList alerts\nCancel alert\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://www.researchgate.net/profile/Winston-Su-2/publication/391596008_Legal_Analysis_on_the_Legal_Subject_of_AI-Generated_Contract/links/681e08f8ded4331557449ed0/Legal-Analysis-on-the-Legal-Subject-of-AI-Generated-Contract.pdf&hl=en&sa=X&d=8114093396001150560&ei=UfokaKSDNYKwieoP1bHc0Q8&scisig=AAZF9b8OEXtipPn5NW9fgsL9gQRk&oi=scholaralrt&hist=ylyK0_8AAAAJ:4974034551180671527:AAZF9b-CBry8NrRagz6L4gSOAv5X&html=&pos=0&folt=cit", "author": ["Bach Le"], "ref": ["1 new citation to articles by Bach Le"]}
