{"title": "Adapting Language Models for Low-Resource Programming Languages", "first_label": ["LLM"], "second_label": [], "data": "A Singha, M Singh, H Hasanbeig, A Radhakrishna- NeurIPS 2025 Fourth Workshop on\nLarge Language Models (LLMs) have achieved remarkable success in code \ngeneration, yet their capabilities remain predominantly concentrated in well-\nresourced programming languages such as Python and Java. In contrast, low\n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng bi vit mi lin quan n nghin cu ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://openreview.net/pdf%3Fid%3D2ctRK8h3AZ&hl=vi&sa=X&d=10639384588679978541&ei=60BCadhJubbqtA-CleJI&scisig=ALhkC2TU1E8-xJojBcX0Q0YHF0cb&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:ALhkC2T2gGOcVPTEcMFcARghNUJN&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "Improving Quality in AI-Generated Code through Prompt Engineering: An Evaluation of the Impact of Prompting Techniques on Software Quality in Code Generated by", "first_label": ["Code"], "second_label": [], "data": "M Paulsson - 2025\nAbstract The use of Large Language Models (LLMs) for code generation is rapidly \nincreasing. While previous investigations on the correctness of AI-generated code \nare widely present, less focus has been placed on the code's further quality attributes \nand how it can be improved. An aspect that can be equally important. This thesis \naims to fill this gap by investigating how LLMs can be guided to generate code that \naligns with software quality principles. Using a mixed methods approach, the study\nTrch dn: Thanh Le-Cong, Ratnadira Widyasari, Chakkrit Tantithamthavorn  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://www.diva-portal.org/smash/get/diva2:1999528/FULLTEXT01.pdf&hl=vi&sa=X&d=16193075811331607910&ei=60BCaYTwC72qieoPuKej0QM&scisig=ALhkC2TTDz5-urwF1NNor-xk3yYw&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:ALhkC2S5kr7kHUQq0DGLL-ZCgBVB&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["1 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
