{"title": "BASFuzz: Towards Robustness Evaluation of LLM-based NLP Software via Automated Fuzz Testing", "first_label": ["LLM", "Fuzzing", "Software Testing"], "second_label": [], "data": "M Xiao, Y Xiao, S Ji, J Tu, P Zhang- arXiv preprint arXiv:2509.17335, 2025\nFuzzing has shown great success in evaluating the robustness of intelligent natural \nlanguage processing (NLP) software. As large language model (LLM)-based NLP \nsoftware is widely deployed in critical industries, existing methods still face two main \nchallenges: 1 testing methods are insufficiently coupled with the behavioral patterns \nof LLM-based NLP software; 2 fuzzing capability for the testing scenario of natural \nlanguage generation (NLG) generally degrades. To address these issues, we\nTrch dn: Towards Reliable Evaluation of Neural Program Repair with", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.17335&hl=vi&sa=X&d=5561943593931128081&ei=G9LVaIWjEKOj6rQPr53X-Qw&scisig=AAZF9b_pb5_048PeH6ooKSBjSJ82&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["2 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "How Far Are We? An Empirical Analysis of Current Vulnerability Localization Approaches", "first_label": ["Vulnerabilities"], "second_label": ["Localization"], "data": "H Xu, Z Chen, J Han, X Zhao, J Yin, S Deng- arXiv preprint arXiv:2509.15777, 2025\nOpen-source software vulnerability patch detection is a critical component for \nmaintaining software security and ensuring software supply chain integrity. \nTraditional manual detection methods face significant scalability challenges when \nprocessing large volumes of commit histories, while being prone to human errors \nand omissions. Existing automated approaches, including heuristic-based methods \nand pre-trained model solutions, suffer from limited accuracy, poor generalization\nTrch dn: VulCurator: A Vulnerability-Fixing Commit Detector  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.15777&hl=vi&sa=X&d=9112354886256225119&ei=G9LVaIWjEKOj6rQPr53X-Qw&scisig=AAZF9b_Y4gjtUlQar3-i9os54Gf1&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["2 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "RelRepair: Enhancing Automated Program Repair by Retrieving Relevant Code", "first_label": ["APR", "Code"], "second_label": ["Repair"], "data": "S Liu, G Bai, M Utting, G Yang- arXiv preprint arXiv:2509.16701, 2025\nAutomated Program Repair (APR) has emerged as a promising paradigm for \nreducing debugging time and improving the overall efficiency of software \ndevelopment. Recent advances in Large Language Models (LLMs) have", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.16701&hl=vi&sa=X&d=15347269361517940440&ei=G9LVaMO1AcasieoPpPjngQI&scisig=AAZF9b8vu1eZydL8Y3sfpnI8ZfQS&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "404: Civility Not Found? Evaluating the Effectiveness of Small Language Models in Detecting Incivility in GitHub Conversations", "first_label": ["LLM"], "second_label": ["Detection"], "data": "M Patrcio, S Eufrsio, A Ucha, LS Rocha, D Coutinho- Simpsio Brasileiro de, 2025\nContext: Incivility in open-source software (OSS) platforms like GitHub can harm \ncollaboration, discourage contributor participation, and impact code quality. Although \ncurrent moderation tools based on Machine Learning (ML) and Natural Language", "link": "https://scholar.google.com/scholar_url?url=https://sol.sbc.org.br/index.php/sbes/article/download/37008/36793/&hl=vi&sa=X&d=8286556912583976160&ei=G9LVaMO1AcasieoPpPjngQI&scisig=AAZF9b_jlkuJK4BY40jB1qNnC7OY&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=1&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "On the Use of Imbalanced Datasets for Learning-Based Vulnerability Detection", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "RZL Foulefack, A Marchetto- IFIP International Conference on Testing Software and, 2025\nStatic code analysis conducted by means of learning-based methods is an essential \npart of Security Testing. Effective learning algorithms are crucial for training reliable \nmodels that can accurately detect weaknesses and vulnerabilities. During models'", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/chapter/10.1007/978-3-032-05188-2_20&hl=vi&sa=X&d=7711185064955775681&ei=G9LVaMO1AcasieoPpPjngQI&scisig=AAZF9b89r6zwK8DmhfjAM2OZUwge&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=2&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "SIExVulTS: Sensitive Information Exposure Vulnerability Detection System using Transformer Models and Static Analysis", "first_label": ["Vulnerabilities", "Static Analysis"], "second_label": ["Detection"], "data": "K Katz, S Moshtari, I Mujhid, M Mirakhorli, D Garcia- arXiv preprint arXiv:2508.19472, 2025\nSensitive Information Exposure (SIEx) vulnerabilities (CWE-200) remain a persistent \nand under-addressed threat across software systems, often leading to serious \nsecurity breaches. Existing detection tools rarely target the diverse subcategories of", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2508.19472&hl=vi&sa=X&d=7796505405812517065&ei=G9LVaMO1AcasieoPpPjngQI&scisig=AAZF9b_N_o9MHRnErNEAJe_2k9p9&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=3&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "PeacemakerBot: A LLM-Powered Bot for Identifying and Reducing Signs of Incivility in GitHub Conversations", "first_label": ["LLM"], "second_label": ["Detection"], "data": "A Gomes, E Mesquita, E vila, C Jeft, A Mesquita- Simpsio Brasileiro de, 2025\nContext: Developers' interactions on collaborative software development platforms \nlike GitHub are key to maintaining technical alignment and community engagement. \nHowever, uncivil behaviors such as disrespectful, sarcastic, or offensive comments", "link": "https://scholar.google.com/scholar_url?url=https://sol.sbc.org.br/index.php/sbes/article/download/37072/36857/&hl=vi&sa=X&d=10125934674601119665&ei=G9LVaMO1AcasieoPpPjngQI&scisig=AAZF9b8Pw9rHvLiGUIjd8lt4clD_&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=4&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "PIONEER: improving the robustness of student models when compressing pre-trained models of code", "first_label": ["Code"], "second_label": [], "data": "X Liu, X Liu, L Bo, X Wu, Y Yang, X Sun, F Zhou- Automated Software Engineering, 2026\nPre-trained models of code have shown significant effectiveness in a variety of \nsoftware engineering tasks, but they are difficult for local deployment due to their \nlarge size. Existing works mainly focus on compressing these large models into small\n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng bi vit mi lin quan n nghin cu ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10515-025-00560-2&hl=vi&sa=X&d=17836676178374949159&ei=G9LVaMO1AcasieoPpPjngQI&scisig=AAZF9b_ryg7uDpBLUFYEs8zWj5qt&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=5&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
