{"title": "SLD-Spec: Enhancement LLM-assisted Specification Generation for Complex Loop Functions via Program Slicing and Logical Deletion", "first_label": ["LLM"], "second_label": ["Generation"], "data": "Z Chen, L Zhang, Z Zhang, JJ Zhang, R Zhou, Y Shen- arXiv preprint arXiv, 2025\nAutomatically generating formal specifications from program code can greatly \nenhance the efficiency of program verification and enable end-to-end automation \nfrom requirements to reliable software. However, existing LLM-based approaches", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.09917&hl=vi&sa=X&d=2122673112308488324&ei=0nHNaM6QBJu1ieoP1tDwoQs&scisig=AAZF9b-CuDfsPWCmN1n_oNohxVgn&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới", "2 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "ExDoS: Expert-Guided Dual-Focus Cross-Modal Distillation for Smart Contract Vulnerability Detection", "first_label": ["Vulnerabilities", "Smart Contracts"], "second_label": ["Detection"], "data": "Y Jia, Y Tian, Y Wang, J Sun, H Xu- arXiv preprint arXiv:2509.10252, 2025\nThe success of smart contracts has made them a target for attacks, but their closed-\nsource nature often forces vulnerability detection to work on bytecode, which is \ninherently more challenging than source-code-based analysis. While recent studies\n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng bi vit mi lin quan n nghin cu ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.10252&hl=vi&sa=X&d=8136317411742995021&ei=0nHNaM6QBJu1ieoP1tDwoQs&scisig=AAZF9b-H1kj3p4b3knTEUU2oHPBi&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=1&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "Developer-LLM Conversations: An Empirical Study of Interactions and Generated Code Quality", "first_label": ["LLM", "Code"], "second_label": [], "data": "S Zhong, Y Zou, B Adams- arXiv preprint arXiv:2509.10402, 2025\nLarge Language Models (LLMs) are becoming integral to modern software \ndevelopment workflows, assisting developers with code generation, API explanation, \nand iterative problem-solving through natural language conversations. Despite \nwidespread adoption, there is limited understanding of how developers interact with \nLLMs in practice and how these conversational dynamics influence task outcomes, \ncode quality, and software engineering workflows. To address this, we leverage\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.10402&hl=vi&sa=X&d=10737433787372387886&ei=0nHNaKXfDr_N6rQP6o3_4AQ&scisig=AAZF9b_2ppdhCQedelx9IekWjFV3&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["2 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
