{"title": "Func: reducing the impact of Android framework evolution on malware detection", "first_label": [], "second_label": ["Detection"], "data": "H Yu, T Wang, LK Shar, H Li, D Lo- Empirical Software Engineering, 2026\nAndroid malware detection approaches commonly use APIs and permissions as \nfeatures for classifying malware. However, since the release of the first Android \noperating system in 2008, the Android framework has undergone numerous version \nupdates. The evolution of the Android framework over time has led to changes in \nAPIs and permissions, including deprecations and replacements. These changes \ncan result in inaccurate characterization of Android malware, thereby affecting\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/article/10.1007/s10664-025-10747-6&hl=vi&sa=X&d=17540314098573029859&ei=vixcaZqlOO6TieoPutPYsQg&scisig=ALhkC2RUwAL6s0MIUfqjIUd7LxcL&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:ALhkC2S5kr7kHUQq0DGLL-ZCgBVB&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Exploring the Potential of Using ChatGPT in Chemistry Education", "first_label": ["LLM"], "second_label": [], "data": "C Morbidoni, A Mascitti, A Sarra, L Tonucci, F Coccia- Journal of Chemical Education, 2026\nThis study investigates the performance of different OpenAI GPT model versions \n(GPT-3.5 Turbo, GPT-4 Turbo, GPT-4o, o1-preview and GPT-5 at different reasoning \neffort values) in solving chemistry problems across various educational and \nconceptual difficulty levels. The evaluation, aimed at assessing both accuracy and \nreasoning quality, was based on a data set comprising 150 multiple-choice \nquestions and 10 open-ended questions at the high school level, as well as 75\nTrch dn: Are we ready to embrace generative ai for software q&a?", "link": "https://scholar.google.com/scholar_url?url=https://pubs.acs.org/doi/full/10.1021/acs.jchemed.5c00854&hl=vi&sa=X&d=3050139244167895374&ei=vixcaZqlOO6TieoPutPYsQg&scisig=ALhkC2QmlqKrA2gSKHNh4kuvpNg-&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:ALhkC2S5kr7kHUQq0DGLL-ZCgBVB&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "A Novel Multi-scale Graph Neural", "first_label": [], "second_label": ["Graph"], "data": "B Geetha, AR Masoom Basha Pinjari, SV Krushna- Volume 1: ICCIC-2024, 2930\nGraph neural networks (GNNs) are powerful models that work on graph-structured \ndata and have been widely used in multiple applications, including network \nneuroscience tasks, bioinformatics tasks, power systems scenarios, and social \nnetwork research. Although successful, most existing GNN models still need to \naccurately model multi-scale information across graphs with different scales \n(abstraction levels), consequently weakening their generalization ability on\nTrch dn: Toward the Analysis of Graph Neural Network  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://books.google.com/books%3Fhl%3Dvi%26lr%3D%26id%3D24WlEQAAQBAJ%26oi%3Dfnd%26pg%3DPA197%26ots%3DlNJRviVMIH%26sig%3DJfFG9ZfJUqXYmXvkYSdngQz04Ow&hl=vi&sa=X&d=13329444626546281236&ei=vixcaZqlOO6TieoPutPYsQg&scisig=ALhkC2QjNF43K_Br6SWnsHRegdO9&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:ALhkC2S5kr7kHUQq0DGLL-ZCgBVB&html=&pos=2&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
