{"title": "Exploring the Security Threats of Retriever Backdoors in Retrieval-Augmented Code Generation", "first_label": ["Code"], "second_label": ["Generation"], "data": "T Li, B Lin, S Wang, Y Tan- arXiv preprint arXiv:2512.21681, 2025\nRetrieval-Augmented Code Generation (RACG) is increasingly adopted to enhance \nLarge Language Models for software development, yet its security implications \nremain dangerously underexplored. This paper conducts the first systematic\n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng bi vit mi lin quan n nghin cu ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.21681&hl=vi&sa=X&d=5268578284595613255&ei=cKhWaavlFqC16rQPm4fPgQQ&scisig=ALhkC2SsFx3iooUoQF6EpSDap8DW&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:ALhkC2T2gGOcVPTEcMFcARghNUJN&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "Understanding the Role of Large Language Models in Software Engineering: Evidence from an Industry Survey", "first_label": ["LLM"], "second_label": [], "data": "VM de Brito, K Farias- arXiv preprint arXiv:2512.21347, 2025\nThe rapid advancement of Large Language Models (LLMs) is reshaping software \nengineering by profoundly influencing coding, documentation, and system \nmaintenance practices. As these tools become deeply embedded in developers' \ndaily workflows, understanding how they are used has become essential. This paper \nreports an empirical study of LLM adoption in software engineering, based on a \nsurvey of 46 industry professionals with diverse educational backgrounds and levels\nTrch dn: Thanh Le-Cong, Ratnadira Widyasari, Chakkrit Tantithamthavorn  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2512.21347&hl=vi&sa=X&d=5399442109481763722&ei=cKhWaY65IZ6u6rQPotyMwAQ&scisig=ALhkC2TN8pZJJK9Eov4pXheb2Lv5&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:ALhkC2S5kr7kHUQq0DGLL-ZCgBVB&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["1 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
