{"title": "Investigating Generative AI's Impact on Software Organizations' Security Practices: A Multi-case Study Using Gioia Methodology", "first_label": [], "second_label": [], "data": "DK Hein- International Conference on Software Business, 2025\nThe integration of generative AI in software organizations presents promising \nopportunities for automating and enhancing security activities; however, its practical \nimpact on the security practices of software organizations and associated risks \nremains underexplored. This study investigates how generative AI can enhance \nsoftware security practices through a multi-case study involving five software \norganizations. By conducting semi-structured interviews with developers and\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/chapter/10.1007/978-3-032-14518-5_12&hl=vi&sa=X&d=16684395359464897539&ei=vq5tac2dOtaOieoPnNOJuQQ&scisig=AHkA5jQRymtqmRnquMRDT5aMCCIl&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "EVALUATING THE CODE GENERATION CAPABILITIES OF CHATGPT THROUGH C++ DATABASE MANAGEMENT TASKS", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "M ALABDULLATIF- Journal of Theoretical and Applied Information, 2026\nLarge language models (LLMs) are becoming important tools in software \nengineering. These models, trained on large amounts of text, can understand and \ngenerate natural language with high accuracy. Today, they are being used across \nmany stages of software development, from improving code quality and generating \ndocumentation to supporting natural language interaction with development tools. \nAmong their many applications, code generation is one of the areas where these\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=http://www.jatit.org/volumes/Vol104No1/35Vol104No1.pdf&hl=vi&sa=X&d=16958200759938636835&ei=vq5tac2dOtaOieoPnNOJuQQ&scisig=AHkA5jRASNcn8X5aoNh-FxsDUS2j&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Is Call Graph Pruning Really Effective?", "first_label": ["Static Analysis"], "second_label": ["Graph"], "data": "M Rafieian, V Birsan, K Katiyar, D Zhong, S Wei - 2026\nCall graph analysis, which approximates calling relationships in a program, is a \nfundamental component of many static analysis tasks, including optimization and \nvulnerability detection. Over the past decades, numerous algorithms have been \nproposed [1, 37, 45, 51], each offering different tradeoffs between soundness, \nprecision, and performance. These tradeoffs heavily influence their practicality in real-\nworld settings. For example, Smaragdakis et al.[52] showed that precise context\nTrch dn: Autopruner: transformer-based call graph pruning  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://mohpydev.github.io/papers/call-graph-pruning-preprint.pdf&hl=vi&sa=X&d=1539073063271051664&ei=vq5tac2dOtaOieoPnNOJuQQ&scisig=AHkA5jSwTk8HcC9BHLtVeLBfBRKp&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=2&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
