{"title": "Investigating Generative AI's Impact on Software Organizations' Security Practices: A Multi-case Study Using Gioia Methodology", "first_label": [], "second_label": [], "data": "DK Hein- International Conference on Software Business, 2025\nThe integration of generative AI in software organizations presents promising \nopportunities for automating and enhancing security activities; however, its practical \nimpact on the security practices of software organizations and associated risks \nremains underexplored. This study investigates how generative AI can enhance \nsoftware security practices through a multi-case study involving five software \norganizations. By conducting semi-structured interviews with developers and\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/chapter/10.1007/978-3-032-14518-5_12&hl=vi&sa=X&d=16684395359464897539&ei=vq5tac2dOtaOieoPnNOJuQQ&scisig=AHkA5jQRymtqmRnquMRDT5aMCCIl&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "EVALUATING THE CODE GENERATION CAPABILITIES OF CHATGPT THROUGH C++ DATABASE MANAGEMENT TASKS", "first_label": ["LLM", "Code"], "second_label": ["Generation"], "data": "M ALABDULLATIF- Journal of Theoretical and Applied Information, 2026\nLarge language models (LLMs) are becoming important tools in software \nengineering. These models, trained on large amounts of text, can understand and \ngenerate natural language with high accuracy. Today, they are being used across \nmany stages of software development, from improving code quality and generating \ndocumentation to supporting natural language interaction with development tools. \nAmong their many applications, code generation is one of the areas where these\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=http://www.jatit.org/volumes/Vol104No1/35Vol104No1.pdf&hl=vi&sa=X&d=16958200759938636835&ei=vq5tac2dOtaOieoPnNOJuQQ&scisig=AHkA5jRASNcn8X5aoNh-FxsDUS2j&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Is Call Graph Pruning Really Effective?", "first_label": ["Static Analysis"], "second_label": ["Graph"], "data": "M Rafieian, V Birsan, K Katiyar, D Zhong, S Wei - 2026\nCall graph analysis, which approximates calling relationships in a program, is a \nfundamental component of many static analysis tasks, including optimization and \nvulnerability detection. Over the past decades, numerous algorithms have been \nproposed [1, 37, 45, 51], each offering different tradeoffs between soundness, \nprecision, and performance. These tradeoffs heavily influence their practicality in real-\nworld settings. For example, Smaragdakis et al.[52] showed that precise context\nTrch dn: Autopruner: transformer-based call graph pruning  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://mohpydev.github.io/papers/call-graph-pruning-preprint.pdf&hl=vi&sa=X&d=1539073063271051664&ei=vq5tac2dOtaOieoPnNOJuQQ&scisig=AHkA5jSwTk8HcC9BHLtVeLBfBRKp&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=2&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["3 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "LAUDE: LLM-Assisted Unit Test Generation and Debugging of Hardware DEsigns", "first_label": ["LLM", "Bug", "Software Testing"], "second_label": ["Generation"], "data": "D Nandal, R Revalor, S Dan, D Pal- arXiv preprint arXiv:2601.08856, 2026\nUnit tests are critical in the hardware design lifecycle to ensure that component \ndesign modules are functionally correct and conform to the specification before they \nare integrated at the system level. Thus developing unit tests targeting various", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.08856&hl=vi&sa=X&d=10404572640964085120&ei=vVNsad6xLqOi6rQPoMCXoAE&scisig=AHkA5jR_OKHVfSGowma7VUv8inzc&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AHkA5jQSH2z-ynDQhPp_cW7HGs_g&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "How well LLM-based test generation techniques perform with newer LLM versions?", "first_label": ["LLM", "Software Testing"], "second_label": ["Generation"], "data": "M Konstantinou, R Degiovanni, M Papadakis- arXiv preprint arXiv:2601.09695, 2026\nThe rapid evolution of Large Language Models (LLMs) has strongly impacted \nsoftware engineering, leading to a growing number of studies on automated unit test \ngeneration. However, the standalone use of LLMs without post-processing has\n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng bi vit mi lin quan n nghin cu ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.09695&hl=vi&sa=X&d=8079752268755392022&ei=vVNsad6xLqOi6rQPoMCXoAE&scisig=AHkA5jTkM-KvBaaMUbY3z3gwmeLS&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AHkA5jQSH2z-ynDQhPp_cW7HGs_g&html=&pos=1&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "Improving Software Project Development Performance Using AI Tools", "first_label": [], "second_label": [], "data": "H Fawareh, SA Dabaa't- for Sustainable Innovation Management and Risk, 2026\nIn recent years, artificial intelligence (AI) techniques have been proposed to support \na wide range of software engineering tasks, such as locating program bugs, writing \ncode automatically, and generating test cases. These promising results have \nmotivated industry practitioners to develop AI-powered development tools to \nenhance the productivity of their company's software engineering activities. As most \nexisting AI tools are developed only for specific tasks and programming languages\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://link.springer.com/chapter/10.1007/978-3-031-95310-1_168&hl=vi&sa=X&d=8435268334101535786&ei=vVNsad7AObux6rQPmKbEyA4&scisig=AHkA5jSHVUGVvpjFYoYV4-6kp4ze&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "DepRadar: Agentic Coordination for Context Aware Defect Impact Analysis in Deep Learning Libraries", "first_label": ["Software Defect"], "second_label": ["Agent"], "data": "Y Gao, X Hu, T Xu, J Zhao, X Yang, X Xia- arXiv preprint arXiv:2601.09440, 2026\nDeep learning libraries like Transformers and Megatron are now widely adopted in \nmodern AI programs. However, when these libraries introduce defects, ranging from \nsilent computation errors to subtle performance regressions, it is often challenging for \ndownstream users to assess whether their own programs are affected. Such impact \nanalysis requires not only understanding the defect semantics but also checking \nwhether the client code satisfies complex triggering conditions involving\nTrch dn: Thanh Le-Cong, Hong Jin Kang, Ratnadira Widyasari, Zhipeng", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.09440&hl=vi&sa=X&d=14662167219108684018&ei=vVNsad7AObux6rQPmKbEyA4&scisig=AHkA5jR2CDBuTIGrYwvbVWRyAP7O&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "A Match Made in Heaven? AI-driven Matching of Vulnerabilities and Security Unit Tests", "first_label": ["Vulnerabilities", "Software Testing"], "second_label": [], "data": "E Iannone, QC Bui, R Scandariato - 2025\nSoftware vulnerabilities are often detected via taint analysis, penetration testing, or \nfuzzing. They are also found via unit tests that exercise security-sensitive behavior \nwith specific inputs, called vulnerability-witnessing tests. Generative AI models could \nhelp developers in writing them, but they require many examples to learn from, which \nare currently scarce. This paper introduces VuTeCo, an AI-driven framework for \ncollecting examples of vulnerabilitywitnessing tests from Java repositories. VuTeCo\nTrch dn: Thanh Le-Cong, Hong Jin Kang, Ratnadira Widyasari, Chengran", "link": "https://scholar.google.com/scholar_url?url=https://emaiannone.github.io/assets/pdf/c8.pdf&hl=vi&sa=X&d=13914107114566660923&ei=vVNsad7AObux6rQPmKbEyA4&scisig=AHkA5jQUqHasphQF3eY08cVhDeyS&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=2&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Many-task optimization algorithm based on adaptive dual knowledge transfer", "first_label": [], "second_label": [], "data": "Y Sun, Q Mei, K Chen, F Liu- Engineering Optimization, 2026\nIn real-world optimization problems, it is crucial to effectively exploit the synergies \namong tasks. Recent advances in evolutionary many-task optimization have \nhighlighted adaptive knowledge transfer, particularly concerning transfer frequency \nand auxiliary task selection. However, the prevailing methods have some limitations, \nincluding complex parameter setting for auxiliary task selection and the inaccuracy of \npopulation-based task similarity measurement. This article proposes an adaptive\nTrch dn: A multifactorial optimization paradigm for linkage tree genetic  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://www.tandfonline.com/doi/abs/10.1080/0305215X.2025.2609847&hl=vi&sa=X&d=13266540031482263786&ei=vVNsad7AObux6rQPmKbEyA4&scisig=AHkA5jRTAkEXz-UWUa7PfHPivwqN&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=3&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
