{"title": "All You Need Is A Fuzzing Brain: An LLM-Powered System for Automated Vulnerability Detection and Patching", "first_label": ["Vulnerabilities", "LLM", "Fuzzing"], "second_label": ["Detection"], "data": "Z Sheng, Q Xu, J Huang, M Woodcock, H Huang- arXiv preprint arXiv, 2025\nOur team, All You Need Is A Fuzzing Brain, was one of seven finalists in DARPA's \nArtificial Intelligence Cyber Challenge (AIxCC), placing fourth in the final round. \nDuring the competition, we developed a Cyber Reasoning System (CRS) that\n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng bi vit mi lin quan n nghin cu ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.07225&hl=vi&sa=X&d=5576671586051393385&ei=IPvGaOu_E-KIieoPyO618QE&scisig=AAZF9b8isFTYsRUjF-VNHQw0ilDM&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "Analisando a Qualidade e Eficcia de Cdigos Gerados por LLMs: Um Estudo com Problemas da Plataforma LeetCode", "first_label": ["LLM", "Code"], "second_label": [], "data": "B Aquino, A Brito, C Tavares, D Boechat, JP Batisteli- Workshop de Visualizao, 2025\nResumo Large Language Models (LLMs) esto revolucionando a engenharia de \nsoftware ao automatizar tarefas de gerao de cdigo. Apesar do aumento na \nprodutividade dos desenvolvedores, ainda h dvidas sobre a qualidade e taxa de \nacerto do cdigo gerado. Este trabalho investiga a eficcia e qualidade de 2.464 \nrespostas de cdigo gerado via GPT-4, Gemini, Claude 3 Haiku e Llama 3.1 em 616 \nproblemas do LeetCode em Python. Os resultados mostram taxas de acertos\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://sol.sbc.org.br/index.php/vem/article/download/36869/36655/&hl=vi&sa=X&d=13510045101474901211&ei=IPvGaOicHozSieoPz_DOyAs&scisig=AAZF9b_muKYPLQiErqNcBVS-vq9Z&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Integrating Static Analysis and LLMs to Refactor ComplexMethods", "first_label": ["LLM", "Static Analysis"], "second_label": [], "data": "S Moussa, M Olsson - 2025\nCode complexity significantly affects the readability and maintainability of large-scale \nsoftware systems. Refactoring is a common practice to address this, and recent \nadvancements in Large Language Models (LLMs) show promise for automating the \nprocess. However, purely LLM-based refactoring often introduces errors or fails to \naddress specific complexity issues. To mitigate such problems, hybrid approaches \nthat combine static analysis with LLMs have been proposed, yet their effectiveness\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://www.diva-portal.org/smash/get/diva2:1996010/FULLTEXT01.pdf&hl=vi&sa=X&d=9175655685309818085&ei=IPvGaOicHozSieoPz_DOyAs&scisig=AAZF9b8vsDS75SwDK_EDUj2zXozc&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "REP4: Automated Testing and Repairing Programmable Data Planes", "first_label": ["Software Testing"], "second_label": ["Repair"], "data": "W Li, F Li, C Liu, X Wang- 2025 IEEE/ACM 33rd International Symposium on, 2025\nWhile the P4-based programmable data plane supports flexible configuration \nregardless of specific hardware or protocols, potential software and hardware \nfailures threaten its performance. However, existing tools fail to efficiently test and \nautomatically repair faults, relying on time-consuming and error-prone manual \nmanipulation. To address these challenges, we propose REP4, a system that \nautomatically detects, localizes, and repairs bugs in programmable data planes\nTrch dn: Invalidator: Automated patch correctness assessment via semantic", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11143362/&hl=vi&sa=X&d=16413338890298884841&ei=IPvGaOicHozSieoPz_DOyAs&scisig=AAZF9b9f6jdUmOAI6coYRpYHWcef&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=2&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "PatchSeeker: Mapping NVD Records to their Vulnerability-fixing Commits with LLM Generated Commits and Embeddings", "first_label": ["Vulnerabilities", "LLM"], "second_label": [], "data": "HH Nguyen, AT Nguyen, T Le-Cong, Y Li, HW Ang- arXiv preprint arXiv, 2025\nSoftware vulnerabilities pose serious risks to modern software ecosystems. While the \nNational Vulnerability Database (NVD) is the authoritative source for cataloging \nthese vulnerabilities, it often lacks explicit links to the corresponding Vulnerability-\nFixing Commits (VFCs). VFCs encode precise code changes, enabling vulnerability \nlocalization, patch analysis, and dataset construction. Automatically mapping NVD \nrecords to their true VFCs is therefore critical. Existing approaches have limitations\nTrch dn: Thanh Le-Cong, Hong Jin Kang, Ratnadira Widyasari, Chengran  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2509.07540&hl=vi&sa=X&d=13677987059493725841&ei=IPvGaOicHozSieoPz_DOyAs&scisig=AAZF9b81YsQlPxe0JEobQdb7JBWZ&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=3&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong", "Thanh Le-Cong - các bài viết mới"]}
