{"title": "Beyond Functional Correctness: Exploring Hallucinations in LLM-Generated Code", "first_label": ["LLM", "Code"], "second_label": [], "data": "F Liu, Y Liu, L Shi, Z Yang, L Zhang, X Lian, Z Li, Y Ma- IEEE Transactions on, 2026\nThe rise of Large Language Models (LLMs) has significantly advanced various \napplications on software engineering tasks, particularly in code generation. Despite \nthe promising performance, LLMs are prone to generate hallucinations, which means\n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng bi vit mi lin quan n nghin cu ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11361549/&hl=vi&sa=X&d=5742920928897379689&ei=jXp7adWPO6Oi6rQPtZyiuAI&scisig=AHkA5jRURP-mApB5SvpHATikE7N7&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AHkA5jQSH2z-ynDQhPp_cW7HGs_g&html=&pos=0&folt=rel", "author": ["Thanh Le-Cong"], "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới", "4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "The Effect of Employee Competence and Work Motivation on the Quality of Financial Reporting", "first_label": [], "second_label": [], "data": "M Irawati, AS Arief, M Yunus- Journal La Bisecoman, 2026\nThis study aims to determine whether employee competence and work motivation \nhave an influence on the quality of financial reporting at the Office of the Airport \nAuthority Region V Makassar. The data in this research were obtained through the \ndistribution of questionnaires as the primary instrument. The sampling technique \nused was the saturated sample method, where all members of the population were \nused as the research sample. Prior to its use, the research instrument was tested for\nTrch dn: Refining chatgpt-generated code: Characterizing and mitigating", "link": "https://scholar.google.com/scholar_url?url=https://www.newinera.com/index.php/JournalLaBisecoman/article/download/2559/2284&hl=vi&sa=X&d=15643844386861895813&ei=jnp7afirC9aOieoPvbTB2Ao&scisig=AHkA5jR_eW6PUav3EF5jqK-JjLkd&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=0&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Survey on Learning-based Dynamic Fault Localization: From Traditional Machine Learning to Large Language Models", "first_label": ["LLM", "Fault Localization"], "second_label": ["Localization"], "data": "C Liu, Y Lei, H Xie, J Wang, Y Yu, D Lo- ACM Computing Surveys\nLearning-based dynamic fault localization techniques play a crucial role in the field \nof software engineering. These techniques dynamically execute test cases to \nmeticulously extract useful knowledge from the execution information in the program, \nwith the aim of identifying fault locations by leveraging machine learning, deep \nlearning, and large language models. Currently, there is already a flourishing body of \nresearch that is intensely focused on learning-based dynamic fault localization\nTrch dn: Thanh Le-Cong, Ratnadira Widyasari, Chakkrit Tantithamthavorn", "link": "https://scholar.google.com/scholar_url?url=https://dl.acm.org/doi/pdf/10.1145/3787202&hl=vi&sa=X&d=3610641333845247826&ei=jnp7afirC9aOieoPvbTB2Ao&scisig=AHkA5jS9ZUYy3cB-NmPOTnI5Rz0F&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=1&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "AI builds, We Analyze: An Empirical Study of AI-Generated Build Code Quality", "first_label": ["Code"], "second_label": [], "data": "A Ghammam, M Almukhtar- arXiv preprint arXiv:2601.16839, 2026\nThe rapid adoption of AI coding agents for software development has raised \nimportant questions about the quality and maintainability of the code they produce. \nWhile prior studies have examined AI-generated source code, the impact of AI \ncoding agents on build systems-a critical yet understudied component of the software \nlifecycle-remains largely unexplored. This data mining challenge focuses on AIDev, \nthe first large-scale, openly available dataset capturing agent-authored pull requests\nTrch dn: Thanh Le-Cong, Ratnadira Widyasari, Chakkrit Tantithamthavorn  \n \nGoogle Scholar gi thng bo ny cho bn v bn ang theo di nhng li trch dn mi trong cc bi vit ca \nThanh Le-Cong\n.\nLit k cnh bo\nHy thng bo", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2601.16839&hl=vi&sa=X&d=11967973676725498114&ei=jnp7afirC9aOieoPvbTB2Ao&scisig=AHkA5jRNo59mb5Du3zEHOiUv27BU&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AHkA5jTPS8thqNJxu8pHnPo4odW8&html=&pos=3&folt=cit", "author": ["Thanh Le-Cong"], "ref": ["4 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
