{"title": "LLM-based Generation of Formal Specification for Run-time Security Monitoring of ICS", "first_label": ["Large Language Models"], "second_label": ["Generation"], "data": "GE Raptis, MT Khan, C Koulamas, D Serpanos\\xc2\\xa0- 2025 IEEE International Conference\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nIndustrial Control Systems (ICS) are vulnerable to cybersecurity threats due to their \ndistributed architecture and critical role in infrastructure sectors. Ensuring their \nsecure operation requires deploying runtime monitoring mechanisms to detect \nbehavioral deviations, with inline security monitoring arising as a practical solution. \nHowever, writing these specifications manually is time-consuming, error-prone, and \nrequires deep domain expertise. In this paper, we explore the feasibility of using\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nTr\\xc3\\xadch d\\xe1\\xba\\xabn: \\xe2\\x80\\xaaCan LLMs Reason About Program Semantics? A Comprehensive\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11130130/&hl=vi&sa=X&d=1833485915756417544&ei=iPGzaMO5JvnSieoPxKLpgQ0&scisig=AAZF9b8rc8dksCWHyDLd6ykXBOlH&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=0&folt=cit", "ref": ["5 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "An AI-powered pipeline for enabling Self-Healing in Software Systems", "first_label": [], "second_label": [], "data": "G Siachamis, G Papadopoulos, AL Symeonidis\\xc2\\xa0- 2025 IEEE International Conference\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nThe continuous digitisation of all types of data and business information, although \nundoubtedly beneficial, has triggered an exponential rise to security risks, as more \nattack vectors are introduced at a high frequency. To facilitate the process of \nsuppressing security threats to software, we present an AI-powered pipeline that \nenables developers to mitigate security alerts identified by security assessment \nreports generated by popular open source security tools. The proposed pipeline\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nTr\\xc3\\xadch d\\xe1\\xba\\xabn: \\xe2\\x80\\xaaComparison of static application security testing tools and large\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11130137/&hl=vi&sa=X&d=9966959413278561935&ei=iPGzaMO5JvnSieoPxKLpgQ0&scisig=AAZF9b_iZKpa5ZeT4pmQniUd477v&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=1&folt=cit", "ref": ["5 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Evaluation of the Code Generated By Large Language Models: The State of the Art", "first_label": ["Large Language Models", "Code"], "second_label": [], "data": "Z Ying, D Towey, Y Zhang\\xc2\\xa0- 2025 IEEE 49th Annual Computers, Software, and\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nThe rapid development of Large Language Models (LLMs), such as ChatGPT and \nDeepSeek, has revolutionized software development, particularly in the domain of \nautomated code generation. These models, built on architectures like the \nTransformer, have demonstrated remarkable capabilities in generating human-like \ntext and source code, significantly enhancing developer productivity and reducing \ndevelopment time. However, the widespread adoption of LLMs for code generation\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nTr\\xc3\\xadch d\\xe1\\xba\\xabn: \\xe2\\x80\\xaaRefining chatgpt-generated code: Characterizing and mitigating\\xc2\\xa0\\xe2\\x80\\xa6\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11126696/&hl=vi&sa=X&d=12484343861239898882&ei=iPGzaMO5JvnSieoPxKLpgQ0&scisig=AAZF9b_7wjcMe67kD6SY7gom0tNW&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=2&folt=cit", "ref": ["5 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "VFProber: A Vulnerability-Fixing Identification Framework Based on Code Changes and Semantic Adjustment", "first_label": ["Vulnerabilities", "Code", "Code Change"], "second_label": [], "data": "J Dong, G Fan, Y Yu, Y Liang, Y Ye, H Yu, W Chen\\xc2\\xa0- 2025 IEEE 49th Annual\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nWith the accelerated development of software, developers face the continuous \nchallenge of fixing vulnerabilities but vulnerability-fixing commits often disassociated \nfrom the vulnerabilities, and the structural and semantic differences between code \nchanges and natural language present significant challenges in identifying these \ncommits. Existing approaches utilize machine learning and deep learning \ntechniques to address this problem, but they often do not fully leverage the\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nTr\\xc3\\xadch d\\xe1\\xba\\xabn: \\xe2\\x80\\xaaMulti-Granularity Detector for Vulnerability Fixes\\xe2\\x80\\xac", "link": "https://scholar.google.com/scholar_url?url=https://ieeexplore.ieee.org/abstract/document/11126599/&hl=vi&sa=X&d=10091484810073408440&ei=iPGzaMO5JvnSieoPxKLpgQ0&scisig=AAZF9b_ERuwIhuYdUW8lIULXjpL1&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=3&folt=cit", "ref": ["5 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Research Directions in Software Supply Chain Security", "first_label": [], "second_label": [], "data": "I RAHMAN, M TAMANNA, G TYSTAHL, N ZAHAN - 2025\nThe modern world relies on digital innovation in almost every human endeavor, \nincluding critical infrastructure. Digital innovation has accelerated substantially as \nsoftware is increasingly built with layers of reusable abstractions, including libraries, \nframeworks, cloud infrastructure, and AI modules. This style of software development \nis considered a software supply chain where software projects depend on and build \nupon other software projects. Based upon its analysis of 1,067 commercial code\\xc2\\xa0\\xe2\\x80\\xa6\n\\xe2\\x80\\xa2\nTr\\xc3\\xadch d\\xe1\\xba\\xabn: \\xe2\\x80\\xaaVulCurator: A Vulnerability-Fixing Commit Detector\\xe2\\x80\\xac  \n \nGoogle Scholar g\\xe1\\xbb\\xadi th\\xc3\\xb4ng b\\xc3\\xa1o n\\xc3\\xa0y cho b\\xe1\\xba\\xa1n v\\xc3\\xac b\\xe1\\xba\\xa1n \\xc4\\x91ang theo d\\xc3\\xb5i nh\\xe1\\xbb\\xafng l\\xe1\\xbb\\x9di tr\\xc3\\xadch d\\xe1\\xba\\xabn m\\xe1\\xbb\\x9bi trong c\\xc3\\xa1c b\\xc3\\xa0i vi\\xe1\\xba\\xbft c\\xe1\\xbb\\xa7a \nThanh Le-Cong\n.\nLi\\xe1\\xbb\\x87t k\\xc3\\xaa c\\xe1\\xba\\xa3nh b\\xc3\\xa1o\nH\\xe1\\xbb\\xa7y th\\xc3\\xb4ng b\\xc3\\xa1o\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://www.kapravelos.com/publications/tosem-directions.pdf&hl=vi&sa=X&d=15468523295392098242&ei=iPGzaMO5JvnSieoPxKLpgQ0&scisig=AAZF9b9TufW503PQh-LPbCpZV45e&oi=scholaralrt&hist=70gU4M0AAAAJ:6246953642887790424:AAZF9b-KfaIzNELg_AxYHyYLV6lH&html=&pos=4&folt=cit", "ref": ["5 lời trích dẫn mới đến bài viết của Thanh Le-Cong"]}
{"title": "Does AI Code Review Lead to Code Changes? A Case Study of GitHub Actions", "first_label": ["Code Review", "Code", "Code Change"], "second_label": [], "data": "K Sun, H Kuang, S Baltes, X Zhou, H Zhang, X Ma\\xe2\\x80\\xa6\\xc2\\xa0- arXiv preprint arXiv\\xc2\\xa0\\xe2\\x80\\xa6, 2025\nAI-based code review tools automatically review and comment on pull requests to \nimprove code quality. Despite their growing presence, little is known about their \nactual impact. We present a large-scale empirical study of 16 popular AI-based code\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2508.18771&hl=vi&sa=X&d=1087042547895093020&ei=iPGzaKeQGZ6s6rQPxqLhuQI&scisig=AAZF9b8tPdgA8_g47l6rpQckHRi_&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=0&folt=rel", "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "Automated Bug Frame Retrieval from Gameplay Videos Using Vision-Language Models", "first_label": ["Bug"], "second_label": [], "data": "W Lu, A Senchenko, A Hindle, CP Bezemer\\xc2\\xa0- arXiv preprint arXiv:2508.04895, 2025\nModern game studios deliver new builds and patches at a rapid pace, generating \nthousands of bug reports, many of which embed gameplay videos. To verify and \ntriage these bug reports, developers must watch the submitted videos. This manual\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2508.04895&hl=vi&sa=X&d=11413311830969918411&ei=iPGzaKeQGZ6s6rQPxqLhuQI&scisig=AAZF9b-NCiqpLdz5tIxck1-Y0eW_&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=1&folt=rel", "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "SIExVulTS: Sensitive Information Exposure Vulnerability Detection System using Transformer Models and Static Analysis", "first_label": ["Vulnerabilities"], "second_label": ["Detection"], "data": "K Katz, S Moshtari, I Mujhid, M Mirakhorli, D Garcia\\xc2\\xa0- arXiv preprint arXiv:2508.19472, 2025\nSensitive Information Exposure (SIEx) vulnerabilities (CWE-200) remain a persistent \nand under-addressed threat across software systems, often leading to serious \nsecurity breaches. Existing detection tools rarely target the diverse subcategories of\\xc2\\xa0\\xe2\\x80\\xa6", "link": "https://scholar.google.com/scholar_url?url=https://arxiv.org/pdf/2508.19472&hl=vi&sa=X&d=7796505405812517065&ei=iPGzaKeQGZ6s6rQPxqLhuQI&scisig=AAZF9b_N_o9MHRnErNEAJe_2k9p9&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=2&folt=rel", "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}
{"title": "Prompting Matters: Assessing the Effect of Prompting Techniques on LLM-Generated Class Code", "first_label": ["Large Language Models", "Code"], "second_label": [], "data": "A Yuen, J Pangas, MMH Polash, A Abdellatif\nThe field of software engineering and coding has undergone a significant \ntransformation. The integration of large language models (LLMs), such as ChatGPT, \ninto software development workflows is changing how developers at all skill levels\\xc2\\xa0\\xe2\\x80\\xa6\n \nGoogle Scholar g\\xe1\\xbb\\xadi th\\xc3\\xb4ng b\\xc3\\xa1o n\\xc3\\xa0y cho b\\xe1\\xba\\xa1n v\\xc3\\xac b\\xe1\\xba\\xa1n \\xc4\\x91ang theo d\\xc3\\xb5i nh\\xe1\\xbb\\xafng b\\xc3\\xa0i vi\\xe1\\xba\\xbft m\\xe1\\xbb\\x9bi li\\xc3\\xaan quan \\xc4\\x91\\xe1\\xba\\xbfn nghi\\xc3\\xaan c\\xe1\\xbb\\xa9u c\\xe1\\xbb\\xa7a \nThanh Le-Cong\n.\nLi\\xe1\\xbb\\x87t k\\xc3\\xaa c\\xe1\\xba\\xa3nh b\\xc3\\xa1o\nH\\xe1\\xbb\\xa7y th\\xc3\\xb4ng b\\xc3\\xa1o\n\\r\\n'", "link": "https://scholar.google.com/scholar_url?url=https://www.researchgate.net/profile/Ahmad-Abdellatif-2/publication/394255549_Prompting_Matters_Assessing_the_Effect_of_Prompting_Techniques_on_LLM-Generated_Class_Code/links/688f775d86911c11bfed27c8/Prompting-Matters-Assessing-the-Effect-of-Prompting-Techniques-on-LLM-Generated-Class-Code.pdf&hl=vi&sa=X&d=1370100941342347490&ei=iPGzaKeQGZ6s6rQPxqLhuQI&scisig=AAZF9b8Vnec2OY49V3WcHZYAdXYP&oi=scholaralrt&hist=70gU4M0AAAAJ:5337116523931328826:AAZF9b-46FvMQTpOKclK0XMbpLrW&html=&pos=3&folt=rel", "ref": ["Thanh Le-Cong - nghiên cứu liên quan mới"]}